{
  "cookies": [
    {
      "name": "White Lily Cookie",
      "rarity": "Ancient",
      "class": "Bomber",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Lily Bud",
        "description": "A pure white lily bud bursts open, dealing periodic damage to enemies and additional damage depending on the number of buffs White Lily Cookie has on herself. Enemies affected by the skill will become entangled in Vines, becoming unable to move or use skills. Whenever an ally Cookie gains a debuff, she will gain the Lily Restoration buff. Once Lily Restoration reaches a certain number of stacks, it will dispel all current debuffs on the allies and heal them. White Lily Cookie is immune to the Spore Dispersal and Mushroom Mutation effects.",
        "effect": [
          "Lily Bud Periodic DMG: up to 3 hits over a span of 1.2 sec",
          "Single-hit DMG: 178.0%",
          "DMG Relative to Max HP: 22.50%",
          "Vines: enemies ensnared and unable to use skill for 2.5 sec",
          "DMG after Vines duration is over or target is immune: 155.0% of ATK",
          "Lily Restoration Passive: gain x1 stack per x5 debuff on White Lily Cookie or allies",
          "Lily Restoration: at x21 stacks, dispels allies' debuffs and heals them for 122.9% of ATK"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/White_Lily_Cookie",
      "magic-skill": null,
      "bio": "A solitary beam of moonlight shines in the twilight. Like a pale lily touched by the gentle drops of rain, a Cookie silently entered the world. Her petals might look soft, and her dough frail, but nothing could stop her steps as she explored every corner of Earthbread, seeking a safer and happier future for all Cookiekind. Alas, at the end of her journey, all she found was the dark truth of this world. That truth painted her faith and curiosity with despair and anger, awakening a terrifying darkness deep within. Will White Lily Cookie find her lost voice once again amidst the deafening silence? With a seed of hatred and despair in her heart, will she walk towards the light once more?"
    },
    {
      "name": "Silverbell Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Gleeful Chime",
        "description": "Silverbell flowers bloom, periodically healing the allies and granting a DMG Resist buff. Healing targets will also receive bonus healing depending on the number of buffs they currently have. Enemies will receive damage and gain the Silverbell Pollen debuff dealing periodic damage. When Silverbell Pollen's duration is over, it will cause area damage and Stun the targets in range. Silverbell Cookie is immune to the Spore Dispersal and Mushroom Mutation effects. Perhaps he might provide additional support to his fellow Knights of the Faerie Kingdom...?",
        "effect": [
          "Single-hit DMG: 138.4% of ATK",
          "Silverbell Pollen DMG: 379.0% of ATK every 0.5 sec for 3.0 sec",
          "Healing: 23.0% of ATK every 1.0 sec for 7.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Silverbell_Cookie",
      "magic-skill": null,
      "bio": "If you ever encounter a wisp of white light, wandering across the misty trees with a cheerful chiming, do not let your guard down. For Silverbell Cookie will never miss a shot. Resembling a soft flower petal adorned with beads of morning dew, Silverbell Cookie is not as delicate as he might seem. As a loyal Knight of the Faerie Kingdom, he has sworn to protect its secrets with his life. And yet, despite the heavy burden of his duty, this Cookie always keeps a pure, bright smile—after all, there is no stronger shield than a loving heart."
    },
    {
      "name": "Rebel Cookie",
      "rarity": "Epic",
      "class": "Ambush",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Here, There, Everywhere!",
        "description": "Rebel Cookie uses his magic, decreasing the enemies’ DEF, making them more vulnerable to all types of damage, and dealing damage. Enemies with decreased DEF will receive additional damage. Rebel Cookie will increase the allies’ CRIT% and provide an HP Shield for them, blocking damage equal to a portion of the damage he has dealt. After finishing using his skill, he will create 2 decoys that will Push enemies back with each Regular Attack. The decoys have a number of Hits instead of HP. While Rebel Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": [
          "Extra DMG to DEF-reduced Targets (Cookies): 78.9%",
          "Extra DMG to DEF-reduced Targets (Others): 315.4%",
          "Decoy DMG: 162.3% of ATK"
        ],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Rebel_Cookie",
      "magic-skill": null,
      "bio": "Be aware, greedy Cookies! One swift Cookie might already be going over your fence to fix injustice as we speak! Rebel Cookie, made with newly harvested rice that was organically farmed with just the right method, is bound to make you feel healthier just by looking at him! With self-taught excellency in magic, he is someplace one second and somewhere else in another, traveling on his cloud to rob the storages of wealthy and corrupt Cookies! Even when he gets locked up by the guards... POOF! He's gone, leaving a straw doll in his stead. Rebel Cookie equally and fairly distributes the stolen Jellies among villagers, which is why every village loves him! He will never stop fighting for justice! Rebel Cookie will undoubtedly go down in history!"
    },
    {
      "name": "GingerBrave",
      "rarity": "Common",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Brave Dash",
        "description": "Dashes forward and deals area damage to all enemies in his way.",
        "effect": ["Single hit DMG: 150.0%"],
        "cd-start": 0,
        "cd-base": 8
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/GingerBrave",
      "magic-skill": null,
      "bio": "GingerBrave was the first Cookie to escape from the Witch's oven. It is unknown how this Cookie came to life, but rumor has it that the Witch accidentally used magic powder instead of ginger powder."
    },
    {
      "name": "Crème Brûlée Cookie",
      "rarity": "Epic",
      "class": "Ranged",
      "location": "Rear",
      "type": "Light",
      "skill": {
        "name": "Accelerando",
        "description": "Crème Brûlée Cookie's passionate, captivating performance deals Light-type damage to enemies and enhances his regular attacks with the Accelerando buff. Crème Brûlée Cookie's regular attacks target the enemy with the highest ATK and, when enhanced, apply the Mysterious Melody buff to nearby Cookies. The pianist will also create Crème Brûlée Pieces depending on the number of Accelerando stacks. Crème Brûlée Pieces will deal damage to enemies in the order of highest ATK, deal additional damage to targets vulnerable to elemental damage, and partially ignore enemies' DMG Resist at maximum Accelerando stacks. Crème Brûlée Cookie will lose x2 Accelerando stacks if the skill effect ends with the maximum number of stacks. While Crème Brûlée Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": [
          "Accelerando DMG: 356.1% of ATK",
          "Enhanced Regular Attacks: 352.0% of ATK",
          "Crème Brûlée Pieces: x4 at Accelerando x1, x4 at Accelerando x2, x6 at Accelerando x3",
          "Mysterious Melody Additional DMG: 115.0% of Crème Brûlée Cookie’s ATK SPD boost rate, scaling with his ATK"
        ],
        "cd-start": 0,
        "cd-base": 9
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Cr%C3%A8me_Br%C3%BBl%C3%A9e_Cookie",
      "magic-skill": null,
      "bio": "Get ready to welcome the star of the night, Crème Brûlée Cookie, famous for his unique reinterpretations of timeless pieces and masterful technique. Having crossed the firmament of academic music like a bright comet, this talented pianist is known for getting extremely sensitive before a performance and leaving the stage as soon as the final note fades away. Such traits have brought forth rumors of Crème Brûlée Cookie's arrogant nature, and yet he doesn't seem to pay them any thought. For all he cares for is music! A notorious perfectionist, Crème Brûlée Cookie keeps practicing feverishly until his inner critic is satisfied. Tonight, the excited audience showers the maestro with generous applause as he appears on stage and sits in front of the grand piano. He lays his hands on the keyboard, and, after a brief moment of tense, sincere silence... all worldly notions surrounding Crème Brûlée Cookie vanish, and the mesmerizing sounds of his music resonate through the hall and beyond, touching the very souls of the listeners."
    },
    {
      "name": "Strawberry Cookie",
      "rarity": "Common",
      "class": "Defense",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Don't Come Near!",
        "description": "Scared Strawberry Cookie spins with her lollipop, dealing damage to all enemies within range.",
        "effect": ["Single hit DMG: 21.0%"],
        "cd-start": 0,
        "cd-base": 10
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Strawberry_Cookie",
      "magic-skill": null,
      "bio": "Shyness can be quite advantageous. Why? Strawberry Cookie contains no real strawberries, only the flavoring. Were she as active and energetic as other cookies, her artificial strawberry fragrance would have worn off in no time! Strawberry Cookie feels so ashamed of her main ingredient, she'd never want the truth to come out. If only she understood that this yummy strawberry scent is one of the many reasons other Cookies love her!"
    },
    {
      "name": "Muscle Cookie",
      "rarity": "Common",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Muscle King Power",
        "description": "Throws a dumbbell with fearsome strength at the nearby enemies, causing Shock within the radius when throwing and when the dumbbell falls.",
        "effect": ["Single hit DMG: 81.0%"],
        "cd-start": 0,
        "cd-base": 10
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Muscle_Cookie",
      "magic-skill": null,
      "bio": "Muscle Cookie's recipe requires large quantities of protein powder and about three weeks of intensive kneading. Only after that, the taste of raw muscle power comes to life. Such a rigorous cooking process has made Muscle Cookie a bit short-tempered. He tends to throw exercise equipment when angry. But don't be afraid: once he's done dealing with Cake Monsters, he's as cool as a cucumber."
    },
    {
      "name": "Caramel Arrow Cookie",
      "rarity": "Epic",
      "class": "Ranged",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Arrow of Resolution",
        "description": "Few enemies can keep their wits when they see the twin blades turning into a bow! Caramel Arrow Cookie performs a ranged attack (targets Cookies first) and leaves an Arrow Mark on the hit enemy. After the ranged attack, the Arrow Mark explodes when Caramel Arrow Cookie rushes towards the enemy, dealing DMG proportional to the enemy's Max HP (this DMG is capped at 300,000). During the ranged attack, Caramel Arrow Cookie receives a buff that makes her immune to debuffs. While Caramel Arrow Cookie is using her skill, she will become resistant to interrupting effects.",
        "effect": [
          "Ranged attack: 8.0 sec",
          "Single hit DMG: 88.3%",
          "Arrow Mark: 12 sec duration, stacks up to max 12 times",
          "DMG relative to Max HP (Cookies): 22.1%",
          "DMG relative to Max HP (Others): 2.2%",
          "Immunity for 8.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 10
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Caramel_Arrow_Cookie",
      "magic-skill": null,
      "bio": "At the very edge of the continent, atop the tall wall of the Black Citadel, stands a figure frowning into the dark. Night and day, all year round, Caramel Arrow Cookie, the First Watcher of the Dark Cacao Kingdom, will always protect the Cookies from the horrors of the Licorice Sea. A master of the Dark Cacao martial art tradition of the black and white twin blades, Caramel Arrow Cookie's loyalty to her king and subordinates remains unwavering even in exile. Some say the kingdom is but a shadow of its former glory, with values like trust being a commodity. But a vow is a vow. Standing there atop the tall wall, Caramel Cookie is staring sharply at the churning dark waters down below. The First Watcher will protect the Dark Cacao Kingdom until the very last crumb."
    },
    {
      "name": "Wildberry Cookie",
      "rarity": "Epic",
      "class": "Defense",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Wild Punch",
        "description": "Wildberry Cookie unleashes his Battle Rage, dealing more powerful attacks and activating his Wild buff that cannot be dispelled. At the end of the Battle Rage mode, Wildberry Cookie musters all his strength, dealing an uppercut and a final blow. The Wild buff will stack with each hit Wildberry Cookie receives: the more stacks he has, the more powerful his final blow's DMG will be. While Wildberry Cookie is dealing an uppercut and his final blow, he will become resistant to interrupting effects. Being a large Cookie, Wildberry Cookie is less affected by Knockback or Flying.",
        "effect": [
          "Max stacks: 30",
          "DMG Resist: 15.0% to all allies during Battle Rage",
          "Uppercut DMG: 19.3%"
        ],
        "cd-start": 0,
        "cd-base": 10
      },
      "magic-candy": "Firm Wild Berries",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Wildberry_Cookie",
      "magic-skill": {
        "name": "Royal Bodyguard",
        "description": "As the Royal Bodyguard, Wildberry Cookie provides an HP Shield for the entire team upon using his skill. Additionally, Wildberry Cookie will gather up his power for a stronger Final Blow.",
        "effect": [
          "HP Shield: blocks DMG equal to 3.0% of Max HP for 5.0 sec",
          "Final Blow Extra DMG: 175.0%"
        ],
        "10": ["Ally CRIT Resist: +10.0% for 10.0 sec"],
        "20": ["Ally CRIT Resist: +15.0% for 10.0 sec"],
        "30": ["Ally CRIT Resist: +20.0% for 10.0 sec"],
        "cd": 10
      },
      "bio": "Filled to the brim with wild tropical berries, Wildberry Cookie's ardent loyalty to the Hollyberry Kingdom is unquestionable. And the brightly gleaming jewel embedded into his mighty gauntlet is proof! Young Wildberry Cookie once roamed the ramshackle alleys of the Hollyberry capital until an unexpected savior offered him a helping hand. Insidious whispers have been following this knight of few words ever since: they claim he is prone to solving problems with brute force, but these rumors cannot be farther from the truth. Wildberry Cookie has sworn to do whatever it takes to protect his kingdom and its royal dynasty! Even though sometimes what it takes is serving generous amounts of berry juice!"
    },
    {
      "name": "Black Lemonade Cookie",
      "rarity": "Epic",
      "class": "Bomber",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Electrifying Rock!",
        "description": "Black Lemonade Cookie plays her electric guitar, dealing damage to the enemy with the highest HP (targets Cookies first), inflicting Zap, and applying debuffs that increase CRIT DMG the enemy receives and decrease their DEF. She then deals damage to the nearby enemies and inflicts a debuff reducing their ATK. Black Lemonade Cookie grants the Electrifying Rock Spirit buff to the team and strengthens her next regular attacks to target the enemy with the highest HP and enemies near them. When Ally Cookies with the Electrifying Rock Spirit buff deal Zap damage or a critical hit, their Electrifying Rock! charge increases. Once the Electrifying Rock! is fully charged, they deal additional damage to enemies. While Black Lemonade Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Zap: 15.0% DMG every 0.5 sec for 10.0 sec",
          "DEF: -25.0% for 10.0 sec",
          "DMG to Nearby Targets: 156.6% of ATK",
          "ATK: -13.5% for 10.0 sec",
          "Electrifying Rock Spirit: 15.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 10
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Black_Lemonade_Cookie",
      "magic-skill": null,
      "bio": "If you happen to pass by a dark basement and hear electrifying guitar sounds along with a fresh citrus scent, you might've just stumbled onto Black Lemonade Cookie's studio! She may look distant and aloof at times, but once she gets on stage, she's a whole new Cookie! With her signature two-tone lemon icing and energizing sound, every Cookie is bound to shake to the rhythm of her music. Some Cookies find Black Lemonade Cookie's music hard to follow, but everyone agrees that all of her songs are a labor of love and passion. and that's what matters to Black Lemonade Cookie, after all. No mater how dark and and small the stage, she'll always continue to sing and give her everything for her dedicated fans!"
    },
    {
      "name": "Burnt Cheese Cookie",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Earth",
      "skill": {
        "name": "Keeper of the Gates",
        "description": "Summons giant boulders from beneath the earth, dealing DMG to nearby enemies and granting Earth-type CRIT(sic) buff for all allies. Afterwards, the boulders explode, dealing DMG and Stunning enemies. Burnt Cheese Cookie grants the Keeper of the Gates and the Curse Protection buffs to himself and the ally Cookie with the highest ATK, absorbing part of the damage they take with DMG Focus and making them Immune to Debuffs. Burnt Cheese Cookie and Golden Cheese Cookie's DMG Resist increases when entering a battle together. If Golden Cheese Cookie becomes enclosed in her Sarcophagus during battle, Burnt Cheese Cookie's ATK and ATK SPD will temporarily increase, and his Cooldown will reset. The Keeper of the Gates and Curse Protection buffs will be applied to Golden Cheese Cookie enclosed in her Sarcophagus first. While using his skill, Burnt Cheese Cookie will briefly become resistant to interrupting effects.",
        "effect": [
          "Boulder DMG: 155.3% of ATK",
          "Boulder Explosion DMG: 381.9% of ATK",
          "Boulder DMG Stun: 2.0 sec",
          "Keeper of the Gates: absorbs 50.0% of DMG the ally with the highest ATK receives and provides Debuff Immunity for 12.0 sec",
          "Curse Protection: x1"
        ],
        "cd-start": 0,
        "cd-base": 10
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Burnt_Cheese_Cookie",
      "magic-skill": null,
      "bio": "To gain entry to the Ever-Gleaming Golden Paradise, you must pass the trials of the Gatekeeper—Burnt Cheese Cookie. Eternally devoted to the Goddess of the Golden City, this Cookie has warded off countless trespassers at the gates of the Golden Cheese Kingdom. Though many have tried, none have managed to proceed past Burnt Cheese Cookie's fearsome jackals and the gatekeeper himself, clad in his jackal mask. When asked, \"Why do you work tirelessly day and night?\" He is reminded of the sacred vow he made to Her Radiance—to protect her kingdom from darkness. So, once again, Burnt Cheese Cookie heads to the gates to serve and protect, to fulfill his duties."
    },
    {
      "name": "Ninja Cookie",
      "rarity": "Common",
      "class": "Ambush",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Swift Strike",
        "description": "Jumps in the air, throwing shuriken twice and causing small-area damage.",
        "effect": ["Single hit DMG: 89.0%"],
        "cd-start": 0,
        "cd-base": 11
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Ninja_Cookie",
      "magic-skill": null,
      "bio": "Just as making perfect dough demands diligent kneading, tireless training is of equal importance on the path of the ninja. The flavor and ingredients of the mysterious Ninja Cookie remain unknown. He is the only Cookie who can jump that many times. Some say he steps on the air itself, others claim he is using some sort of a shadow clone technique... And with training, he can jump even higher! Sky's the limit, literally."
    },
    {
      "name": "Werewolf Cookie",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Transformation",
        "description": "Takes his wolf form, causing area damage. In the wolf form, Werewolf Cookie has increased HP, becomes resistant to interrupting effects, and does more powerful double-strike regular attacks. Targets hit by double strikes may be stunned.",
        "effect": [
          "Single hit DMG: 206.9%",
          "Regular attack DMG during Transformation: 77.0%",
          "Transformation: 20% chance of Stun for 1 sec with each regular attack"
        ],
        "cd-start": 0,
        "cd-base": 11
      },
      "magic-candy": "Ash Moonstone",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Werewolf_Cookie",
      "magic-skill": {
        "name": "Lone Hunter",
        "description": "Enemies that are hit by regular attacks during transformation are inflicted with Injury. If Werewolf Cookie attacks injured enemies while transformed, he will inflict the Fatal Wound and Torn Scar debuff. At the end of his transformation, deals a final strike to his enemies. Werewolf Cookie's Magic Candy makes him heavier, making him less affected by Knockbacks and Flying.",
        "effect": [
          "Debuff Resist: 40.0% during Transformation",
          "Injury: Max HP -1.2% (at the start of the battle) for 17 sec, Injury cannot reduce Max HP by more than 25%",
          " Increases Injury cap by 40.0% for 17 sec",
          "Final hit DMG: 30.0% of Werewolf Cookie's Max HP"
        ],
        "10": [
          "Torn Scar: lasts for 17 sec, triggers after reaching 2 stacks",
          "Torn Scar triggered: DMG worth 100.0% of ATK + 30.0% DMG relative to Injury"
        ],
        "20": ["Torn Scar triggered: +35.0% DMG relative to Injury"],
        "30": ["Torn Scar triggered: +40.0% DMG relative to Injury"],
        "cd": 11
      },
      "bio": "Together with a great amount of pepper, a wolf hair had fallen into the cookie dough by accident. Now, whenever Werewolf Cookie feels scared or threatened, his wolf instinct kicks in to transform him into a feral beast. A long time ago, when a friend was in great peril, Werewolf Cookie managed to save them by transforming, at a cost. With his true nature revealed to the whole town, he was cast away out of fear and has been living alone in the forests since. With so much pain inside, this Cookie tastes bitter and salty (of tears). Don't ask about his scar or try to get close, as he will only push you away..."
    },
    {
      "name": "Beet Cookie",
      "rarity": "Common",
      "class": "Ranged",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Hunter's Sense",
        "description": "Shoots several bolts in a row at a target with the lowest HP. The bolt also casts a debuff reducing Healing. Don't mess with a hunter!",
        "effect": [
          "Single hit DMG: 67.0%",
          "Healing received: -50.0% for 5.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Beet_Cookie",
      "magic-skill": null,
      "bio": "A strong, persistent, rocky-soil-enduring wild beet was used in the making of Beet Cookie. This Cookie not only inherited all these qualities of her mother ingredient but also went up a notch, becoming able to survive just about anywhere! Beet Cookie settled in the deep forest and has been protecting her territory with her trusty crossbow ever since. Storm, rain, blizzard, or vicious predators-no threat is too serious. There's only one thing that can spring a surprise on this lonely ranger: unexpected Cookie visitors."
    },
    {
      "name": "Adventurer Cookie",
      "rarity": "Rare",
      "class": "Ambush",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Rope Master",
        "description": "They're not expecting it! Adventurer Cookie appears behind the rearmost enemy, attacks with a rope and incapacitates them.",
        "effect": ["Single hit DMG: 410.0%", "Shackles: 4.0 sec"],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Adventurer_Cookie",
      "magic-skill": null,
      "bio": "For a long time, there have been only rumors of Adventurer Cookie's travels far and wide beyond the Witch's island, but now he's back and ready to guide the other Cookies into uncharted territories of a new exciting world. Adventurer Cookie had got quite a lot of stories to tell: about legendary dragons, kingdoms in ruins, but... So little time! His thirst for the unknown is unquenchable, and he will continue to roam the wide world as long as possible."
    },
    {
      "name": "Chili Pepper Cookie",
      "rarity": "Epic",
      "class": "Ambush",
      "location": "Middle",
      "type": "Fire",
      "skill": {
        "name": "Cheap Shot",
        "description": "Chili Pepper Cookie increases her CRIT DMG based on her CRIT%. Sneaks behind the enemy, causing area damage to the rearmost line with 4 strikes. The final strike always deals critical damage.",
        "effect": [
          "Passive: For every 1.0% of self CRIT%, increases 2.00% CRIT DMG up to 200.0%",
          "Single hit DMG: 83.4%"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Chili_Pepper_Cookie",
      "magic-skill": null,
      "bio": "Chili Pepper Cookie's dough contained much more chili pepper than allowed by the law. This is probably why she doesn't care much about rules at all! Chili Pepper Cookie is a notorious treasure hunter. She never misses a chance to snatch everything valuable she can get her hands on, leaving only chaos and havoc behind. The Cookies know better than to cross her path, and so should you. Good news: you can easily identify this path by a trail of fiery red chili sauce..."
    },
    {
      "name": "Purple Yam Cookie",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Purple Tornado",
        "description": "Ravages the battlefield in a deadly Purple Tornado, causing substantial periodic area damage. While Purple Yam Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": ["Single hit DMG: 54.0%"],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": "Spiked Sweet Potato",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Purple_Yam_Cookie",
      "magic-skill": {
        "name": "Berserker's Fury",
        "description": "Ravages the battlefield in a deadly Purple Tornado, causing substantial periodic area damage. With the Magic Candy upgrade, his skill Cooldown is reduced. Starting from the beginning of the battle, receives the Berserker's Fury buff every 15 seconds. The Berserker's Fury stacks up to 4 stacks, and after the fourth stack, the Berserker's Spirit buff is activated. Upon stacking Berserker's Fury, Purple Yam Cookie will grow heavier and become less affected by Knockback or Flying.",
        "effect": [
          "Berserker's Fury: ATK +20.0%, CRIT% +20.0%, DMG Resist +8.0%, ATK SPD +10.0% per stack",
          "Cooldown: -20.0%",
          "Berserker's Spirit: Restores 15.0% of Max HP every 0.5 sec for 3.0 sec."
        ],
        "10": [
          "Berserker's Fury Bonus Effect +20.0% Debuff Resist per stack",
          "Berserker's Spirit Bonus Effect: +30.0% DMG Resist"
        ],
        "20": [
          "Increases Debuff Resist by 30.0% per stack of Berserker's Fury.",
          "Reduces DMG received by 40.0% with Berserker's Spirit."
        ],
        "30": [
          "Increases Debuff Resist by 40.0% per stack of Berserker's Fury.",
          "Reduces DMG received by 50.0% with Berserker's Spirit."
        ],
        "cd": 12
      },
      "bio": "Purple Yam Cookie was baked in extreme temperatures again and again until the heat finally got to his head. Ever since, Purple Yam Cookie has been in an angered state (to say the least!) that's why we advise being extremely cautious around him. When the wrath kicks in, this Cookie begins to crush and smash the surroundings in a dangerous tornado of rage. And as if that wasn't enough, Purple Yam Cookie is always eager to fight someone! The Cookie claims that no one has suffered in the \"flames of hell\" more than him, but... it seem like no one has had a chance to tell him that other Cookies went through the Witch's oven too..."
    },
    {
      "name": "Milk Cookie",
      "rarity": "Epic",
      "class": "Defense",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Noble Sacrifice",
        "description": "Stands at the front line, causing area damage, and taunts the enemies, forcing them to attack himself. While the skill is active, Milk Cookie's Divine Milk Shield decreases incoming damage. While Milk Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": [
          "-50.0% DMG for 5.0 sec",
          "Single hit DMG: 219.0%",
          "Taunt for 5.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": "Calcium-Rich Milk",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Milk_Cookie",
      "magic-skill": {
        "name": "Noble Resolution",
        "description": "Stands at the front line, causing area damage, and taunts the enemies, forcing them to attack himself. While the skill is active, Milk Cookie's Divine Milk Shield decreases incoming damage. While Milk Cookie is using his skill, he will briefly become resistant to interrupting effects. At the end, Milk Cookie removes all debuffs and heals HP equal to a portion of damage he blocked.",
        "effect": [
          "Healing: 30.0% of damage blocked with the shield",
          "Bonus Skill DMG: 77.5%",
          "Debuff Resist (Self): +8.0% for 10.0 sec",
          "Purify: all debuff effects"
        ],
        "10": [
          "Noble Resolution: Greater DMG with regular attacks; stacks up to x3:",
          "True DMG relative to Max HP (Cookies): 1.00%",
          "Single hit DMG (Others): 20.0% of ATK"
        ],
        "20": [
          "Noble Resolution: Greater DMG with regular attacks; stacks up to x3:",
          "True DMG relative to Max HP (Cookies): 1.25%",
          "Single hit DMG (Others): 25.0% of ATK"
        ],
        "30": [
          "Noble Resolution: Greater DMG with regular attacks; stacks up to x3:",
          "True DMG relative to Max HP (Cookies): 1.50%",
          "Single hit DMG (Others): 30.0% of ATK"
        ],
        "cd": 12
      },
      "bio": "Everything the light touches, let there be peace! Milk Cookie made a divine oath to protect the world from all evil. When raising up the Healing Milk Mace, a splendid glow soars to the skies and bathes the world in light. The forces of evil flee in terror at the sight of the Divine Milk Shield. Milk Cookie has faced many foes, and yet his resolve remains unsullied by corruption and despair. Even on the brink of exhaustion, this selfless and noble protector will cast a blessing of protection for other Cookies first."
    },
    {
      "name": "Schwarzwälder",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Choco Chip Hammer",
        "description": "Each(sic) Schwarzwälder’s regular attack has a chance to stun the target. The first cooldown of his skill will be shortened, allowing for faster skill use. Upon using the skill, Schwarzwälder will receive the Howling effect, increasing his own ATK SPD, and DMG Resist, and increasing the team's ATK. When the effect duration is over, Schwarzwälder will charge at the enemies, strike them with his hammer, stun them, and inflict the Hammer Shock debuff. The debuff will reduce the enemies’ ATK and cause them to receive more damage from the next Schwarzwälder’s skill attacks with the hammer. While Schwarzwälder is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": [
          "Regular Attack Stun: 1.0 sec with 50.0% chance",
          "Charge DMG: 79.2%"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Schwarzw%C3%A4lder",
      "magic-skill": null,
      "bio": "Red eyes, rough mane, sharp fangs! His name is Choco Werehound Brute, and his enormous hammer will make the Cookie Kingdom tremble! And if the sound of the distant thumping of this fearsome giant's heavy feet is not enough, his roar will make you faint! Choco Werehound Brute might be no more than Licorice Cookie's underling running itsy-bitsy errands, but his ambitions do not end here. Far from it! One day, he will become the strongest Cake Monster, and then, THEN...! The whole world will fear the name \"Choco Werehound Brute!\" And so, the big dreamer bids farewell to another gorgeous sunset under the pouring rain... The life of an upstart villain is rough and tough, but Choco Werehound Brute must be strong. He must not let anyone know of his proper aristocratic upbringing and his real name... Schwarzwälder."
    },
    {
      "name": "Pinecone Cookie",
      "rarity": "Epic",
      "class": "Bomber",
      "location": "Front",
      "type": "Ice",
      "skill": {
        "name": "Pinecone Bomb",
        "description": "Pinecone Cookie gets up on the tree golem and simultaneously heals themselves and the two allies with the highest ATK. While Pinecone Cookie is riding the tree golem, their Max HP is increased. Pinecone Cookie then throws Pinecone bombs at the enemy Cookie with the highest ATK, Stunning them. The Pinecone Bombs deal area damage to nearby enemies. If there are targets suffering from Frost within the area damage range, they will also become Stunned. If a target is immune to Stun, it will receive additional DMG.",
        "effect": [
          "Bomb Area DMG: 122.5%",
          "Bomb Area DMG ignoring DMG Resist: 25.0%",
          "Bomb Explosion Stun for targets with Frost: 0.3 sec",
          "Additional DMG to targets immune to Stun: 225.0%",
          "Tree Golem: heals self for 50.0% of ATK once, increases Max HP by 200.0% during ride"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": "Dainty Pine Cone",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Pinecone_Cookie",
      "magic-skill": {
        "name": "Snowy Forest",
        "description": "Thanks to the piled up snow, Pinecone Cookie will have their DEF and DMG Resist increased while on the Tree Golem. They will also become resistant to ATK SPD Debuffs. After getting off the Tree Golem, Pinecone Cookie will gain an HP Shield with HP equal to a portion of their Max HP.",
        "effect": [
          "DMG Resist on Tree Golem: +15.0%",
          "DEF on Tree Golem: +20.0%",
          "ATK SPD Debuff Resist on Tree Golem: +35.0%",
          "HP Shield on Tree Golem: blocks DMG equal to 30.0% of Max HP for 10 sec"
        ],
        "10": ["ATK SPD on Tree Golem +40.0%"],
        "20": ["ATK SPD on Tree Golem +45.0%"],
        "30": ["ATK SPD on Tree Golem +50.0%"],
        "cd": 12
      },
      "bio": "If you see a little Cookie running among the trees, it's probably Pinecone Cookie, the mighty keeper of the forest. Get outta the way! Busy, busy! The forest is so vast, yet there's only one Pinecone Cookie! There is so much to do: help the forest animals prepare for winter hibernation, straighten out the quarreling birds, find and scratch that itchy patch of bark for the oak tree, and much more! Each choco bark layer of Pinecone Cookie's imposing hat is filled with eagerness to protect their woodland home. That's right: the forest has been their home for as long as they can remember—which is why they prefer the company of trees and animals. Yes, the mighty forest keeper is hardly familiar with the ways of their fellow Cookies! But what does it matter when they know everything about the forest dwellers and can understand the language of the rustling leaves?!"
    },
    {
      "name": "Space Doughnut",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Doughnut Beam",
        "description": "Fires the Doughnut Beam, dealing damage, reducing the targets' DEF, and amplifying debuffs they receive. Hit targets will turn into donuts (excluding bosses and Cookies). The target will receive extra damage if they are already afflicted with a DEF-reducing debuff. When the targets turned to donuts reach a certain number, Space Doughnut will use Super Doughnut Blast, rolling over the enemies, dealing damage and Stunning them. Space Doughnut does not take damage while using their skill.",
        "effect": [
          "Doughnut Beam DMG",
          "Donut Transformation: 2.0 sec",
          "Super Doughnut Blast: triggers at x10 Donut Transformations",
          "Super Doughnut Blast DMG",
          "Cookies: 183.7% of ATK",
          "Others: 229.6% of ATK",
          "Stun: 1.5 sec"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Space_Doughnut",
      "magic-skill": null,
      "bio": "Communication with this mysterious creature has proven to be a rather daunting task. We have yet to determine where they came from, where they are going, or even what they taste like... Does the Space Doughnut know? Another mystery! However, nothing stops us from befriending this adorable being even though we don't share the same language. And it seems like the Space Doughnut has already made a bunch of flat friends on their way here!"
    },
    {
      "name": "Royal Margarine Cookie",
      "rarity": "Epic",
      "class": "Ambush",
      "location": "Middle",
      "type": "Poison",
      "skill": {
        "name": "Buttercream Blast",
        "description": "Royal Margarine Cookie soars on Buttercream's back and fires Buttercream Blasts at the 3 enemies with the highest ATK thrice. Buttercream Blasts deal damage, Poison the targets, reduce their ATK and DEF, and amplify debuffs they gain. Next, Buttercream swoops down towards the enemies, dealing damage and additional damage in proportion to the number of periodic damage effects the targets' have applied. Buttercream Blasts target boss monsters first. While Royal Margarine Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": [
          "Buttercream Blast DMG: 29.7% per hit",
          "Buttercream Blast Poison DMG: 12.2% (Cookies), Poison 21.4% (Others) every 1.0 sec for 10.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Royal_Margarine_Cookie",
      "magic-skill": null,
      "bio": "When the shadow of the golden dragon glides over Dragon City, it is not fear and dread that fills the old alleyways, but rather excitement and anticipation. The famous Royal Margarine Cookie has arrived! Look at those sleek locks, jaunty attire, and the shiny butter knife tucked under his belt— there is no doubt that this Cookie is the last descendant of the legendary Dragon Rider Clan. Indeed, any seasoned dragon hunter will immediately know that his companion Buttercream is no dragon but a wyvern. But as long as Royal Margarine Cookie is using his dazzling smile as a distraction, such details are no longer of importance. Be careful, however: just one look at that smile is enough to make anyone fall for this handsome Dragon Rider!"
    },
    {
      "name": "Tarte Tatin Cookie",
      "rarity": "Epic",
      "class": "Ranged",
      "location": "Rear",
      "type": "Fire",
      "skill": {
        "name": "Cannonade",
        "description": "When Tarte Tatin Cookie fires her cannon, she reduces her own Cooldown and Shackles her enemies after a certain number of hits. Upon using her skill, she will fire a cannonball straight towards the center of the enemy team. Hit enemies suffer from Burn and Bosses receive extra damage. After a certain number of skill uses, Tarte Tatin Cookie will fire an enhanced cannonball. During the battle, when Tarte Tatin Cookie successfully defeats an enemy or a boss, her ATK will increase. While Tarte Tatin Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Cooldown: -1.5 sec with each Regular Attack hit",
          "Shackles: 3.0 sec after x3 Regular Attack hits",
          "Cannonball Explosion DMG:",
          "271.1% of ATK (Cookies)",
          "417.1% of ATK (Others)",
          "Extra DMG to Bosses: 785.5% of ATK",
          "Enhanced Cannonball DMG: Total Cannonball Explosion DMG x1.5",
          "Burn DMG: 17.7% every 0.5 sec for 8.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Tarte_Tatin_Cookie",
      "magic-skill": null,
      "bio": "Whether it's the past or the future of dragon hunting, you can be sure that Tarte Tatin Cookie is part of it! Years and years of carrying around her customized cannon on dragon hunts far and wide has helped build Tarte Tatin Cookie's reputation as an extremely skilled and experienced dragon hunter. The way she confronts the dragons, massive threats to all Cookiekind, without even a trace of fear is reminiscent of the Ancient Heroes. It inspires the Cookies around her and sets their battle spirit aflame! Tarte Tatin Cookie may seem hard to approach because of her aloof personality and serious attitude. But unlike her cold exterior, she has a warm side to her that means she never forgets a friend. After all, the best hunters are those who have a lot to protect. You're sure to find Tarte Tatin Cookie fighting another enormous beast somewhere again today, firing her cannon without hesitation. BOOM!"
    },
    {
      "name": "Shining Glitter Cookie",
      "rarity": "Super Epic",
      "class": "Magic",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "All Eyes on the Stage!",
        "description": "Shining Glitter Cookie begins singing the Glittering Song, dispelling all debuffs from herself, applying the Glittering Rock Spirit buff to her allies, and dealing damage to the enemies. Whenever the song lands a critical hit, it will partially ignore the target's DMG Resist and Zap them. If Shining Glitter Cookie manages to deal a certain number of critical hits with the Glittering Song, she will provide a CRIT DMG Resist buff for the entire team. While Shining Glitter Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Glittering Song Single Hit DMG: 40.9% of ATK",
          "DMG Resist Bypass (Song CRIT): 35.0%"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Shining_Glitter_Cookie",
      "magic-skill": null,
      "bio": "In the morning, she is in a music show on TV. In the afternoon, smiling at you from a signed poster in a café. In the evening, dancing on a giant neon billboard! Not a day goes by without seeing Shining Glitter Cookie! Her songs are guaranteed instant hits, her live performance are unrivaled. At the peak of her pop stardom, she's ready to take on a new genre: ROCK! Turns out Shining Glitter Cookie was a fan of rock music all along. Haters will say there is no place for a fancy pop star in the world of rock, but that won't stop Shining Glitter Cookie! Get ready, Earthbread: Shining Glitter Cookie's Rock Spirit is about to dazzle you away!"
    },
    {
      "name": "Crimson Coral Cookie",
      "rarity": "Super Epic",
      "class": "Defense",
      "location": "Front",
      "type": "Water",
      "skill": {
        "name": "Somber Affection",
        "description": "Crimson Coral Cookie's sisters will lend their powers to the crimson spear, piercing enemies and dealing damage. Afterwards, Crimson Coral Cookie will cast an HP Shield to the 2 allies with the highest ATK (excluding herself) equal to a portion of her Water-type Skill damage. If Crimson Coral Cookie is the only Cookie in the front line, she and her allies will gain the Coral Armor buff. Additionally, her Coral Armor's size and weight will reduce the effect of Knockback and Flying. When Crimson Coral Cookie is using her skill, she is not affected by ATK SPD changes and will become resistant to interrupting effects.",
        "effect": [
          "Spear Single-hit DMG: 142.6% of ATK",
          "Sea Wave DMG: 279.8% of ATK",
          "HP Shield (Two Cookies with the Highest ATK): equal to 85.0% of total Skill DMG for 5.0 sec",
          "When Alone in the Front Line Starts with HP Shield equal to 15.5% of Max HP and lasting for 15.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Crimson_Coral_Cookie",
      "magic-skill": null,
      "bio": "Hearken to me, Legion of Tearcrown! The echo of Crimson Coral Cookie's stern voice rolls above the crashing waves, summoning a great host of seahorses, marlins, and whales to protect the treasured kingdom of the Gem Mermaids. Born with a crimson coral, this Cookie has vowed to protect her homewaters, and all denizens of the ocean, even the Almighty Sea herself, bowed in respect. In every battle, Crimson Coral Cookie is at the forefront, bravely wielding her spear from the back of her trusty seahorse companion. The Gem Mermaid's heart softens only when she is with her beloved sisters. Some even say they have seen a faint shadow of a smile on the face of Tearcrown's most stalwart protector!"
    },
    {
      "name": "Frilled Jellyfish Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Middle",
      "type": "Water",
      "skill": {
        "name": "Frilled Snare",
        "description": "Upon using her skill, Frilled Jellyfish Cookie ensnares up to 5 enemies (targets Cookies first) with her tentacles, dealing Sea Foam damage and reducing their ATK SPD. The targets are inflicted with Zap and take increased Water-type DMG. Additionally, Frilled Jellyfish Cookie will burrow in the ground and protect herself with a DMG Resist buff. When Frilled Jellyfish Cookie uses her skill, ATK SPD changes don't affect her actions. If Frilled Jellyfish Cookie is defeated, she will dissipate into several little jellyfish, who will periodically provide Healing for the team.",
        "effect": [
          "Snare: 2.6 sec",
          "Sea Foam DMG to Ensnared Targets: 188.6% of ATK every 0.5 sec for 2.6 sec",
          "ATK SPD: -99.0% for 0.70 sec",
          "Little Jellyfish: Healing for 11.6% of ATK every 1.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Frilled_Jellyfish_Cookie",
      "magic-skill": null,
      "bio": "\"What news do you bring today, jellyfish?\" Frilled Jellyfish Cookie asks her little friends coming from all corners of the sea first thing in the morning. There is no other Cookie in the entire kingdom of Tearcrown with a keener eye for cleanliness and beauty. Carried by seawater, Frilled Jellyfish Cookie appears wherever there is a need for tidying up. Perhaps it is thanks to her tireless efforts the scenery of the Kingdom of Merfolk is so breathtaking. Frilled Jellyfish Cookie's soft, Jelly-like body allows her to float anywhere in the Saccharine Sea, yet she has chosen to serve only one Cookie. When asked why, she always answers, \"How could I not love someone full of life?\""
    },
    {
      "name": "Fettuccine Cookie",
      "rarity": "Epic",
      "class": "Defense",
      "location": "Front",
      "type": "Earth",
      "skill": {
        "name": "Unstable Fettuccine",
        "description": "Fettuccine Cookie taunts enemies and smacks them down with her giant fettuccine arms, dealing DMG, making the enemies prone to Earth-type DMG and reducing their ATK. Next, she restores her HP and gains a Fettuccine Wraps buff. This slightly confused Cookie's Unstable Aura reduces enemies' ATK within its range and restores the team's HP after a given number of enemies within said range are defeated. The more Fettuccine Cookie's Max HP is reduced, the more her DMG Resist increases. Once per battle, after being defeated, Fettuccine Cookie becomes Immortal and decreases enemies' ATK SPD with her Unstable Aura at the expense of her own ATK SPD for the duration of her Immortal state. While Fettuccine Cookie is using her skill, she will become resistant to interrupting effects.",
        "effect": [
          "Unstable Fettuccine DMG: 377.8% of ATK",
          "Healing: 46.5% of ATK every 1 sec for 7 sec",
          "Taunt: 12.0 sec",
          "Enemy ATK: -19.5% for 8.0 sec",
          "Unstable Aura: enemy ATK -15.0% for 5 sec",
          "Unstable State: Immortality for 5.0 sec, ATK SPD -50.0%",
          "Fortified Unstable Aura: enemy ATK SPD -20.0% for 5 sec"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Fettuccine_Cookie",
      "magic-skill": null,
      "bio": "Woo... In the vibrant domain of the Golden Cheese Kingdom, one Cookie stands out from the usual crowd—Fettuccine Cookie! While the residents of the Golden City adorn themselves in sparkling gold and jewels, Fettuccine Cookie is wrapped in stale pasta noodles. Then again... considering her instinctive attraction to precious metals, there's no doubt she hails from the Kingdom of Gold. One look at this Cookie slowly trudging the kingdom's dark alleys, unaware of her origin or purpose, will send a chill down some Cookies dough. Who knows: you might end up transported to a hidden corner of the Golden Cheese Kingdom. Some even say that Fettuccine Cookie herself might be the error... Whether she knows about this theory is unclear, as her only interest seems to be gazing at her reflection in the waters to see if her pasta noodle is wrapped tight."
    },
    {
      "name": "Wizard Cookie",
      "rarity": "Common",
      "class": "Magic",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Magic Storm",
        "description": "Summons a magic lightning storm that moves forward, dealing damage over time to all enemies within range.",
        "effect": ["Single hit DMG: 40.0%"],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Wizard_Cookie",
      "magic-skill": null,
      "bio": "Wizard Cookie came to possess the Witch's Candy Wand by accident (or not?). Within it, he discovered unique magical powers. His popping candy ice cream cone hat is the finishing touch to his wizard look. Frequently used spells include the festive Hocus-Party-Pocus and Abra-Cookie-Cadabra, which brings unexpected luck and fun."
    },
    {
      "name": "Princess Cookie",
      "rarity": "Rare",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Royal Swing",
        "description": "The world is full of adventure! Princess Cookie swings her scepter with a noble smile, causing area damage and decreasing the enemies' Defense.",
        "effect": ["Single hit DMG: 319.0%", "-15.0% DEF for 6.0 sec"],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Princess_Cookie",
      "magic-skill": null,
      "bio": "Don't be fooled by her adorable smile and cute hairdo. She's not the graceful and regal princess you're looking for! Trouble follows the ever-curious Princess Cookie everywhere she goes, but somehow she manages to sort things out. After all, it's hard not to fall for Her Majesty's charm!"
    },
    {
      "name": "Knight Cookie",
      "rarity": "Rare",
      "class": "Defense",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Calvary Charge",
        "description": "Charges forward, causing area damage and forcing the enemies to attack himself.",
        "effect": ["Single hit DMG: 260.0%", "Taunt for 3.0 sec"],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Knight_Cookie",
      "magic-skill": null,
      "bio": "Knight Cookie, a noble warrior in shiny white chocolate armor decorated with milky foam. You can always count on this devoted Cookie, for he will never let you down. If only he could express his true feelings as freely as he wields his lance."
    },
    {
      "name": "Avocado Cookie",
      "rarity": "Rare",
      "class": "Defense",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Battle Smithing",
        "description": "Strikes the ground with her hammer several times, dealing area damage. The clear sound of ringing metal raises the party's Morale, increasing Attack Power of the Cookie with the highest Attack Power.",
        "effect": ["Single hit DMG: 55.0%"],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Avocado_Cookie",
      "magic-skill": null,
      "bio": "Gather some avocados (the more, the better!) ripened under the hot sun (the more ripe, the better!), then mash, mash, MASH! That's how you can make a healthy and nutritious Avocado Cookie! But you know what terribly lacked nutrients growing up? Her sense of humor! And you will soon know why. Avocado Cookie is a famous master smith. She spends days and nights at the smithy making this and that. It is said that Avocado Cookie can create just about anything! Except for a decent joke, ahem."
    },
    {
      "name": "Gumball Cookie",
      "rarity": "Rare",
      "class": "Bomber",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Art-illery",
        "description": "Boom-boom-boom! The Cookie shoots three bubble gum charges at the enemies, each causing area damage and decreasing the enemies' Attacking Speed.",
        "effect": ["Single hit DMG: 264.0%", "-20.0% ATK SPD for 6.0 sec"],
        "cd-start": 0,
        "cd-base": 0
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Gumball_Cookie",
      "magic-skill": null,
      "bio": "The hard outside and soft inside of a gumball were separated, then evenly mixed into the batter and—ta-da!—Gumball Cookie was born! If you smell a sweet and sour aroma, Gumball Cookie is nearby! He is out on a mission to transform the dull world into a fun and colorful playground with his gumball cannon! Walls? Ceiling? Obstacles? Everything is a canvas for this mischievous cookie! It is said that he angered the Witch by coloring her oven the day after he was born. He is frowned upon sometimes for his turbulent nature, but he will stop at nothing to share his art with the world."
    },
    {
      "name": "Vampire Cookie",
      "rarity": "Epic",
      "class": "Ambush",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Vampirism",
        "description": "Turns into a bat and attacks the rearmost enemy, drinking their blood and restoring some HP depending on the amount of damage caused. Restores some HP with each regular attack.",
        "effect": ["Vamparism: 15.0% of DMG", "Single hit DMG: 581.0%"],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": "Aromatic Grape Juice",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Vampire_Cookie",
      "magic-skill": {
        "name": "Fatal Bite",
        "description": "Turns into a bat and attacks the rearmost enemy, drinking their blood and restoring some HP depending on the amount of damage caused. Enemies hit by the skill suffer from the Vampiric Bite debuff. When the debuffed enemy is hit by a skill attack, the attack will always result in a critical hit. Vampire Cookie's regular attack hits the three nearest enemies and restores his HP.",
        "effect": [
          "Extra DMG to single hit: 44.5%",
          "Vampiric Bite DMG:",
          "Cookies: 55.4% DMG (+0.5-0.6% per level) every 0.5 sec for 20.0 sec",
          "Others: 32.9% DMG (+0.3-0.4% per level) every 0.5 sec for 20.0 sec",
          "Vampiric Bite Extra DMG:",
          "Cookies: 83.3% (+4-4.1% per level) per stack, up to 200.0% extra DMG",
          "Others: 20.8% (+1-1.1% per level) per stack, up to 50.0% extra DMG"
        ],
        "10": ["Revival: Vampire Cookie is revived once with 10.0% HP and Cooldown reset, and is Invulnerable for 1.0 sec."],
        "20": ["Revives the Cookie with 15.0% more HP."],
        "30": ["Revives the Cookie with 20.0% more HP."],
        "cd": 13
      },
      "bio": "The Witch, busy baking several Cookies at once, had forgotten to use her favorite high-quality grapes. Instead, she stored them in oak barrels and let age for a long, long time. And with that special grape juice, she made Vampire Cookie. Naturally, it was difficult for Vampire Cookie to wake up at first—after all, his dough contained more than 10% of strong grape juice! Unlike the other cookies, Vampire Cookie prefers to do nothing but enjoy life. He wasn't even bothered by the heat of the oven and only escaped because his sister Alchemist Cookie dragged him outside. With his pale face and smug posture, he likes to relax with a glass of grape juice and ponder the meaning of life."
    },
    {
      "name": "Dark Choco Cookie",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Sword of Darkness",
        "description": "Strikes the ground with his great sword, inflicting chain lightning upon the enemies. Those unfortunate, affected by this dark lightning suffer from great damage and lowered Defense.",
        "effect": ["Single hit DMG: 247.0%", "-20.0% DEF for 7.0 sec"],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Dark_Choco_Cookie",
      "magic-skill": null,
      "bio": "Long ago, this Cookie stepped into the world of Darkness to become a hero, but fate had a different plan: Dark Choco Cookie was unfortunate enough to happen upon the forbidden Strawberry Jam Sword. As soon as the would-be hero grasped the weapon, the dark power of the magic sword took over. From that moment on, Dark Choco Cookie's life changed forever. Now, dark clouds and thunderstorms follow this ill-fated Cookie, feared by all. It is said that Dark Choco Cookie is still fighting against the magic sword's control."
    },
    {
      "name": "Sparkling Cookie",
      "rarity": "Epic",
      "class": "Healing",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Sparkling Cocktail",
        "description": "Throws refreshing healing cocktails at two allies with the lowest HP. The cocktail's divine aroma raises the whole squad's morale, increasing their Critical Strike Chance.",
        "effect": ["Healing: 139.0% of ATK"],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Sparkling_Cookie",
      "magic-skill": null,
      "bio": "This is the day! You have received an invitation to the famous Sparkling Party. Sparkling Cookie greets you personally with a dazzling smile and offers a glass of Sparkling Juice. All the guests are fascinated with his impeccable manners and looks: his boyish rolled up sleeves and bouncy bubble hair. It is going to be the best holiday party ever!"
    },
    {
      "name": "Tiger Lily Cookie",
      "rarity": "Rare",
      "class": "Ranged",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Tiger Rider",
        "description": "Charges forward on the back of the Butter Tiger, causing damage to nearby enemies and stunning them. While the effect is active, the Cookie deals more damage with faster Regular Attacks.",
        "effect": [
          "Tiger Rider: attacks atop the Butter Tiger for 5.0 sec",
          "Single hit DMG: 127.0%",
          "Stun: 3.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Tiger_Lily_Cookie",
      "magic-skill": null,
      "bio": "It is not known how Tiger Lily Cookie ended up in the jungle all by herself. Under the constant threat of encroaching enemies, her senses grew sharp. In contrast to her rough outward appearance, she is soft and delicate on the inside. Her only family is her trusty Butter Tiger, whom she cherishes more than anything in the world. Her great skill with the spear and excellent jumping abilities make her one tough Cookie to beat."
    },
    {
      "name": "Madeleine Cookie",
      "rarity": "Epic",
      "class": "Defense",
      "location": "Front",
      "type": "Light",
      "skill": {
        "name": "Commander's Honor",
        "description": "Calls upon the Celestial Light that allows performing ranged area attacks instead of regular attacks. While under the Celestial Light, Madeleine Cookie receives a buff making him immune to debuffs.",
        "effect": ["Immunity for 10.0 sec", "Single hit DMG: 108.0%"],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": "Majestic Madeleine",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Madeleine_Cookie",
      "magic-skill": {
        "name": "Power of the Light",
        "description": "With the Power of the Light, Madeleine Cookie will deal extra damage with his skill. Upon using his skill, he will unleash the Power of the Light after a certain number of attacks, dealing greater damage and extra true damage proportional to his Max HP. Madeleine Cookie will restore his own HP whenever he unleashed the Power of the Light. Once the skill is over, the remaining Light becomes a shield to Madeleine Cookie. (DMG relative to Max HP is capped at 300,000)",
        "effect": [
          "Skill Extra DMG: Light Element 76.0% of ATK",
          "Unleashed Light: Light Element 267.0% of ATK",
          "Unleashed Light Extra DMG:",
          "True DMG relative to Max HP (Cookies): 3.0%",
          "Single hit DMG (Others): 280.7%",
          "Light Healing: 149.6% of ATK",
          "HP Shield: 13.5% of Max HP for 5.0 sec"
        ],
        "10": [
          "Team's Light-type Attack DMG: +20.0% for 20.0 sec; stacks up to x2"
        ],
        "20": [
          "Team's Light-type Attack DMG: +25.0% for 20.0 sec; stacks up to x2"
        ],
        "30": [
          "Team's Light-type Attack DMG: +30.0% for 20.0 sec; stacks up to x2"
        ],
        "cd": 13
      },
      "bio": "An offspring of a noble Cookie family from a peaceful republic across the ocean, Madeleine Cookie, armed with his family's influence and shiny new armor, is already the Commander of a knight order. On the day of his Commander's Oathtaking, Madeleine Cookie dedicated himself to the Divine and was granted the Sword and Shield of Radiant Light, which he prizes the most among his numerous possessions. The glorious Knight Commander's usual duties included trotting around the city on his snow-white sugar horse or letting his heavy cape flutter dramatically on the wind during his sparring sessions. Not too long ago, the heroic Madeleine Cookie set on a quest in search of the legendary Soul Jam capable of granting Cookies eternal life! Will the noble paladin's first campaign bear fruit?"
    },
    {
      "name": "Pastry Cookie",
      "rarity": "Epic",
      "class": "Ranged",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Battle Prayer",
        "description": "Injustice shall be purged! After a regular attack, Pastry Cookie fires an arrow of light at the nearest enemy. Under the effect of the Battle Prayer, the Cookie's regular attack DMG and ATK SPD are increased.",
        "effect": [
          "Single hit DMG: 80.0%",
          "Lightbringer Arrow Ricochet Hits: 2",
          "Lightbringer Arrow Richet DMG: 75.0%"
        ],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Pastry_Cookie",
      "magic-skill": null,
      "bio": "\"In the name of the Dough, the Oven, and the Witches, I shall fulfil my sacred duty!\" Pastry Cookie left her name and her past behind on the day of her Sacred Brining when she was rebaked as a devoted sister of the Holy Pastry Order. \"... like a rolling pin flattening the many layers of pastry dough into uniformity, hardships and suffering produce the endurance to conquer the temptations of our crumbly bodies and souls.\" Now, looking from under the golden phyllo veil, these eyes see nothing else but a turbulent world to be rebuilt in the Order's image. Wielding the Fork of Judgement, her consecrated crossbow, Pastry Cookie has set on her next mission to investigate a tainted shrine. And you would be wise not to stand in her way: the cruel cold metal hungers to deliver judgement."
    },
    {
      "name": "Lilac Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Chakram Throw",
        "description": "Lilac Cookie throws his chakrams in several rounds over a period of time. Friendly units are impressed by the graceful movements, and gain increased regular attack DMG proportional to their ATK SPD boost rate.",
        "effect": [
          "Single hit DMG: 105.0%",
          "Regular attack DMG increase: Inflict extra damage equal to 0.4% of the Cookie's ATK for each 1.0% of ATK SPD boost rate"
        ],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Lilac_Cookie",
      "magic-skill": null,
      "bio": "Lilac petals are known as one of the core ingredients of the love potion. Finely sliced fragments of these petals were sprinkled into the dough and baked under the scorching desert sun. Lilac Cookie treads behind the veil of darkness only to appear with a gust of petals, mere moments before his unsuspecting foes take their final breath. Luring his targets with an irresistible fragrance, Lilac Cookie swiftly sends them to their end with his razor-sharp chakrams, leaving neither footprints nor a sound. The only remnants of his presence are but a few purple petals on the ground... and the lingering, yet soothing scent of lilac in the air."
    },
    {
      "name": "Tea Knight Cookie",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Battlemaster",
        "description": "Whenever an allied Cookie falls, Tea Knight Cookie will gain two stacks of the Wrath of the Commander buff. Whenever the Cookie uses his skill, he will deal true damage relative to the target's Max HP (capped at 300,000) and Stun them. Targets immune to Stun will receive additional damage. When the target Cookie is defeated, Tea Knight Cookie's Cooldown will decrease, and some of his HP will be healed. With the Magic Candy, Tea Knight Cookie will briefly become resistant to interrupting effects when using his skill.",
        "effect": ["Single hit DMG: 542.4%"],
        "cd-start": 0,
        "cd-base": 18
      },
      "magic-candy": "Sleek Silver Infusers",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Tea_Knight_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "There was a time when dreadful dragons ruled the skies. Their fire ravaged entire kingdoms, and their claws crumbled countless Cookies. An order of knight in shiny silver armor, infused with courage and battle prowess, swore to put an end to this threat. Led by Tea Knight Cookie, the knights courageously opposed the gargantuan monsters through fire and jam an remained in history. But even the most fragrant tea loses its aroma--with time, the glorious tale of the knight became a legend, a mere echo of the past. Tea Knight Cookie, the fearless hero, was forgotten by those he strove to protect. Now sadness and regret shadow his scar-ridden face. Perhaps he wanted to be forgotten...? Yet... when he reminisces the battles he fought side by side with his comrades of old, a spark lights up in his eyes: the flame within him still burns bright!"
    },
    {
      "name": "Sherbet Cookie",
      "rarity": "Super Epic",
      "class": "Ranged",
      "location": "Middle",
      "type": "Ice",
      "skill": {
        "name": "Frost Shards",
        "description": "Summons 15 frost shards, divides them based on the number of targets, and attacks the enemies, cycling between them in the order of the highest ATK. Frost shards deal additional damage depending on the number of Frost stacks. Targets with frost shards are inflicted with Frost and Nullify Debuff Resist debuffs. There is a chance of hit targets to become Frozen as well. Frozen targets receive additional damage when thawed. The amount of this additional damage and the chance of becoming Frozen increases depending on the number of Frost stacks. Sherbet Cookie is partially immune to Freezing and, thanks to the Warm Light of Life effect, will convert healing that exceeds his Max HP to an HP Shield. While Sherbet Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": [
          "Frost Shards DMG: 39.3% per Shard",
          "Frost Additional DMG: 49.2% (Cookies), 15.0% (others) per Shard",
          "Freezing DMG: 42.2% of ATK",
          "Frost Resistance: Sherbet Cookie gets -50.0% to Freezing DMG and duration",
          "Warm Light of Life: 55.0% of Healing exceeding Max HP is converted to HP Shield (capacity is capped at 30.0% of Max HP)"
        ],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Sherbet_Cookie",
      "magic-skill": null,
      "bio": "Here comes winter, where all life falls asleep under the soft blanket of snow. If you suddenly feel a gust of warm breeze on a chilly day, the frost spirit might have passed you by! Sherbet Cookie is always where the glistening first snow is falling gently on your windowsill. He takes the coldest and harshest winds with him, leaving you with the gift of cozy winter. No wonder everyone is waiting for this bright and friendly spirit’s arrival! Sherbet Cookie always dreamt of traveling the world, yet he was destined to become one with ice crystals. A single drop of warmness helped him turn into the freedom-loving sherbet snow spirit. Now, Sherbet Cookie never stays long in one place, traveling across the lands wherever the wind takes him. Still, there always will be a special memory that fills his heart with hope and warmth—a stubborn lantern light that will never stop waiting for his return!"
    },
    {
      "name": "Stardust Cookie",
      "rarity": "Super Epic",
      "class": "Ambush",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Wrath of the Stars",
        "description": "Stardust Cookie soars in the sky and marks the enemy with the highest ATK (targets Cookies first) with the Sign of the Stars. Then he will descend to deal area damage to the enemies, amplifying debuffs they receive. Targets will receive additional damage depending on the number of buffs they currently have. The Sign of the Stars prevents the target from gaining buffs, decreases their ATK and Healing, and increases the DMG received. If the skill delivers a critical hit, the target will fall Asleep. If the Sign of the Stars is dispelled, the target and the nearby enemies will receive damage. After casting his skill, Stardust Cookie will gain a DMG Resist buff himself. If the enemies are Asleep, Stardust Cookie summons meteors to attack them.",
        "effect": [
          "Wrath of the Stars DMG: 231.6% of ATK",
          "Additional DMG per No. of Buffs: 65.0% of ATK per buff",
          "Sign of the Stars: prevents buffs for 20.0 sec, increases DMG received by 35.0%, reduces ATK by 30.0%, reduces Healing by 40.0%",
          "Upon dispelling Sign of the Stars:",
          "Meteor DMG: 301.5% of ATK"
        ],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Stardust_Cookie",
      "magic-skill": null,
      "bio": "It is hard to say how long the lonesome speck of Cookie dough had been drifting in the vast emptiness of space before the radiance of nameless stars blessed it with the gift of life. Was it a mere coincidence...? For Stardust Cookie, the warmth of many suns was the heat of the oven, and the distant planets were his only companions in his light-speed journey across galaxies. Beckoned by shapeless, fleeting nebulae, guided by the whispering of the stars, Stardust Cookie headed to the City of Wizards to uncover the secret of his birth. Was he trying to find his long-lost purpose, or, on the contrary, escape his predetermined fate...? With a glint of a stray shooting star, this lonesome voyager crosses someone's sky tonight, seeking a place to call home."
    },
    {
      "name": "Pitaya Dragon Cookie",
      "rarity": "Dragon",
      "class": "Charge",
      "location": "Front",
      "type": "Fire",
      "skill": {
        "name": "Draconic Bladestorm",
        "description": "Pitaya Dragon Cookie fires off two waves of draconic blade energy, dealing damage and reducing the amount of Healing the targets receive. After this, the Cookie assumes their dragon form and spews flaming breath to deal damage ignoring DMG Resist and reducing the targets' ATK. Whenever Pitaya Dragon Cookie uses their skill, they gain a stack of Pitaya Fury that will enhance the skill upon reaching the maximum stacks. When using the enhanced skill, Pitaya Dragon Cookie's flaming breath will deal damage ignoring DMG Resist and decrease the target's resistance to Fire-type DMG. In their dragon form, the Cookie will gain increased CRIT% and remove all debuffs applied to themselves. As a Dragon Cookie, Pitaya Dragon Cookie will receive less damage from other Dragon Cookies and have their DMG Resist increased in proportion to their ATK enhanced with Toppings. While Pitaya Dragon Cookie is using their skill, they will briefly become resistant to interrupting effects.",
        "effect": [
          "Draconic Blade Energy DMG: 119.9% per hit",
          "Pitaya Fury: skill enhancement upon x2 stacks",
          "DMG from other Dragon Cookies: -30.0%"
        ],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Pitaya_Dragon_Cookie",
      "magic-skill": null,
      "bio": "Eons ago, terrifying creatures roamed the land. Existing long before Cookies ran, there was a gargantuan Red Dragon with flames burning hotter than brimstone and scales shining brighter than rubies. Within the crater of a volcano, the dragon would wake with a thunderous roar that shook the heavens. Soaring the skies, this legendary behemoth terrorized the world with cataclysmic firestorms. Cookies of the past told tales of this tremendous creature meddling with mortal affairs and burning entire kingdoms down to the ground... until its powers suddenly began to wane. Could it be that one of the dragon's nefarious deals went awry...? After biding time behind a veil of smoke and lava, a smaller and crispier form emerged: Pitaya Dragon Cookie. Will the world witness the dreaded firestorms of legend once more?"
    },
    {
      "name": "Sorbet Shark Cookie",
      "rarity": "Epic",
      "class": "Ambush",
      "location": "Middle",
      "type": "Water",
      "skill": {
        "name": "Shark Splash",
        "description": "The Cookie ambushes the frontmost enemies in shark form, dealing area damage. Deals additional damage to the two enemies (targets Cookies first) with the highest Max HP within the skill's area of effect. For enemies that are Cookies, the additional attack will be dealt as true damage relative to the enemies' Max HP and cannot exceed 300,000. For other enemies, the additional damage will be regular damage.",
        "effect": [
          "Single hit DMG: 128.1%",
          "DMG Relative to Max HP (Cookies): 18.0%",
          "Single Hit DMG (Others): 378.0%"
        ],
        "cd-start": 0,
        "cd-base": 17
      },
      "magic-candy": "Sorbet Icing Fish",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Sorbet_Shark_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "Once upon a time, there was a shark that lived in the deep blue sea. This curious swimmer often popped up to the surface to watch the pirates party on their ships. The shark yearned to join the Cookies for these parties, but they always ran away. Saddened, the shark disappeared into the sea for ages. Until suddenly... Sorbet Shark Cookie burst forth from the depths! This Cookie is, frankly, not the fastest runner, can only make bubbly noises instead of words, and gets soggy in the water just like everyone else. But even so, Sorbet Shark Cookie is always wearing a bright smile! After all, the world above the sea is vast and there's so many things to see!"
    },
    {
      "name": "Golden Cheese Cookie",
      "rarity": "Ancient",
      "class": "Ranged",
      "location": "Middle",
      "type": "Earth",
      "skill": {
        "name": "Brilliance of the Absolute",
        "description": "Upon using her skill, Golden Cheese Cookie throws her Spears of Radiance, dealing damage up to 8 times when there are five or more enemies. For each enemy defeated, she gains an extra Spear of Radiance. The number of Spears can increase to up to 12 in total. When hit by the spear, enemies receive a debuff amplifying the Earth-type damage received. While Golden Cheese Cookie is using her skill, she harnesses her Light of Abundance and hurls the Spear of the Absolute to the enemy Cookie with the highest ATK. The Spear of Absolute removes the target’s buffs, deals DMG, Explosion DMG, and additional DMG based on the current number of Spears of Radiance to all enemies in range. Once per battle, if Golden Cheese Cookie is about to be defeated, she encloses herself in a Sarcophagus for a certain period of time. While enclosed in her Sarcophagus, she casts a Shield around herself. This Shield takes the DMG dealt to nearby allies covered by it and provides Knockback Immunity. When using her skill, Golden Cheese Cookie is not affected by ATK Speed changes and is protected from the Glitch: Data Corruption and Glitch: Copy effects by her Light of Abundance.",
        "effect": [
          "CRIT%: -35.0% for 6.0 sec",
          "Spear of the Absolute Area DMG",
          "Sarcophagus Stats: 150.0% of the Cookie's ATK, 200.0% of HP, 185.0% of DEF, 100.0% of DMG Resist",
          "Ever-Gleaming Shield: 35.0% of Sarcophagus's Max HP for 6.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 13
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Golden_Cheese_Cookie",
      "magic-skill": null,
      "bio": "Worship the Ever-Radiant Sovereign of the Golden City! Golden Cheese Cookie dwells in a gilded palace amidst the dunes of the Parmesan Desert. Cookies fall to their knees in exultation at the glimpse of her—body adorned with shining gold, godlike confidence, and magnificent wings. A mere flick of her wrist forms a golden mountain, another, a river—powers only a god can wield. Her greed knows no bounds, as this Cookie yearns for more to call her own, from treasures to even her faithful subjects. Following her desires, Golden Cheese Cookie filled the kingdom with riches, flowing freely like cheese fondue. She could’ve had it all: her eternal kingdom, the pinnacle of opulence and bliss. If it weren’t for that fated day, that is..."
    },
    {
      "name": "Snow Sugar Cookie",
      "rarity": "Epic",
      "class": "Magic",
      "location": "Middle",
      "type": "Ice",
      "skill": {
        "name": "Blizzard",
        "description": "Waves the Snow Sugar Wand to summon the Snow King that causes a snowstorm, dealing periodic area damage, and applying the Frost debuff with a certain chance upon each hit. Enemies suffer lowered ATK SPD. Snow King is resistant to certain action and movement-impairing effects. While Snow Sugar Cookie is using their skill, they will briefly become resistant to interrupting effects.",
        "effect": [
          "Snow King: 26.0% of the sommoner's ATK, 125.0% of DEF, 150.0% of HP",
          "ATK SPD Reduction: -25.0% within the snowstorm range"
        ],
        "cd-start": 0,
        "cd-base": 20
      },
      "magic-candy": "Snow Meringue",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Snow_Sugar_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "Made of snow, sugar, and an unknown secret ingredient, this Cookie was once very lonely, wandering through a vast snowy field. Then one day, Snow Sugar Cookie found a magic wand that could summon snow creatures and wouldn't melt even in the oven. The Cookie quickly learned to summon friends like the Sea Snow Cone and the Great Snow King and was never lonely again."
    },
    {
      "name": "Kumiho Cookie",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Somersault",
        "description": "Transforms into a Cookie and causes area damage and charming nearby enemies, while charming them and reducing their DEF. Afterward, fires a powerful Fox Spirit Flame up to 5 enemies near Kumiho Cookie and turns back into marshmallow fox.",
        "effect": [
          "Single hit DMG: 245.4%",
          "Charmed: 2.0 sec",
          "-20.0% DEF for 8.0 sec",
          "DMG bonus during transformation: 251.2%"
        ],
        "cd-start": 0,
        "cd-base": 14
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Kumiho_Cookie",
      "magic-skill": null,
      "bio": "A fox-shaped marshmallow wished to become a Cookie so much that it mastered a spell to shapeshift into a Cookie by surviving only on flour and butter for 999 days. As a result, she can now disguise herself as a seductive and attractive Cookie. Anyone who catches even a glimpse of her will instantly fall in love. Perhaps she's dazzling them with her nine tails."
    },
    {
      "name": "Licorice Cookie",
      "rarity": "Epic",
      "class": "Magic",
      "location": "Middle",
      "type": "Poison",
      "skill": {
        "name": "Licorice Servants",
        "description": "Summons a powerful Black Lightning and Licorice Servants. The potent spell briefly increases the party's Defense. Licorice Servants are resistant to certain movement interrupting effects. If the skill is used before the summoned Licorice Servants disappear, new additional Licorice Servants will be summoned. While Licorice Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": [
          "Single hit DMG: 239.0%",
          "Summons Licorice Servants with 5.0% ATK, 150.0% DEF, and 50.0% HP"
        ],
        "cd-start": 0,
        "cd-base": 14
      },
      "magic-candy": "Licorice Skull Candy",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Licorice_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "With a great portion of the blackest licorice extract in his dough and a grim-looking scythe, this Cookie is up to no good. From a young age, Licorice Cookie dreamed of becoming a wizard but never received the recognition he so rightfully deserved. Eventually, he turned to the forbidden arts of Black Magic. With time, Licorice Cookie assembled a small army of Chewy Licorice Servants raised to do his bidding. On his dark path, he met Dark Enchantress Cookie. The might of the sorceress astonished Licorice Cookie, and it didn't take long before he swore his allegiance. Now, the Cookie is working flat out to earn his new mistress's favor. And it seems like Dark Enchantress Cookie is not easily pleased, as Licorice Cookie's diary filled with everyday rants and complaints could fill up a library."
    },
    {
      "name": "Black Raisin Cookie",
      "rarity": "Epic",
      "class": "Ambush",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Shadow Watcher",
        "description": "No one can hide from the keen Black Raisin Eye! The Cookie vanishes into the shadows, appears amidst the enemy ranks (targets Cookies first), and strikes several times, dealing substantial area damage.",
        "effect": ["Single hit DMG: 79.0%"],
        "cd-start": 0,
        "cd-base": 14
      },
      "magic-candy": "Chewy Raisins",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Black_Raisin_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "Harsh wind, crooked trees, streets ravaged by the war... Who is it there, hiding among the shadows? Black Raisin Cookie, the sole protector of the unfortunate remnants of a once-great Kingdom. Made of shriveled, wrinkly raisins, this Cookie has learned the value of survival no matter what. Even having lost one arm to the dangers of this rough barren, this Cookie keeps hunting for scarce food to feed those who put their trust in her. Despite all the hardships, Black Raisin Cookie doesn't lose the warmth of a Cookie heart: everyone deserves help, even a sorry one-legged crow. A new day is breaking, and another challenge is here. But Black Raisin Cookie will be there for the villagers, watching over them from the dark."
    },
    {
      "name": "Raspberry Cookie",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Raspberry Reprise",
        "description": "Quickly dashes at the enemy with the highest ATK and continuously stabs them. The attack briefly reduces the hit target's ATK for a while. While Raspberry Cookie is using her skill, she will be more resistant to interrupting effects.",
        "effect": [
          "Single hit DMG: 42.0%",
          "DMG of final hit: 334.0%",
          "ATK Reduction: 40.0% for 3.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 14
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Raspberry_Cookie",
      "magic-skill": null,
      "bio": "Amidst the generous raspberry fields illuminated by the Hollyberry Kingdom's hot sun, proudly stands the grand Chateau Raspberry. In this place of history and culture, Raspberry Cookie was born and raised. Just like her great ancestors, she began fencing even before she learned the intricacies of aristocratic etiquette and rhetoric. Raspberry Cookie has been molded to become the heir and defender of the noble House Raspberry, sworn to protect its legacy. With her sword in hand, elegantly glazed hair fluttering in the summer breeze, and the proud House Raspberry banners behind her back, Raspberry Cookie is about to claim another victory from the clasp of fate."
    },
    {
      "name": "Moon Rabbit Cookie",
      "rarity": "Epic",
      "class": "Defense",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Giant Rice Cake Bunny",
        "description": "After transforming into a Giant Rice Cake Bunny, Moon Rabbit Cookie jumps up and down, dealing DMG to all enemies. Enemies hit with this skill will be marked with a Healing Rice Cake, and when the marked enemies are defeated, the Healing Cake will restore the HP of all allies. The healing amount will depend on the target. While Moon Rabbit Cookie is using her skill, she will be more resistant to interrupting effects.",
        "effect": [
          "Single hit DMG: 127.9%",
          "Self-healing: 160.0% of ATK",
          "Healing Cake: heals all allies if the target is defeated within 10.0 sec",
          "Healing: 253.4% of ATK (if Healing Cake's target is a Cookie)",
          "Healing: 24.2% of ATK (if Healing Cake's target is not a Cookie)"
        ],
        "cd-start": 0,
        "cd-base": 14
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Moon_Rabbit_Cookie",
      "magic-skill": null,
      "bio": "Fresh rice harvested from the happy soils of the Cookie World was used for baking the happy Moon Rabbit Cookie. This Cookie's chubby cheeks are always filled with sweet rice cakes. And while some may think it's cute, her craving for more rice cakes might be one of the strongest forces of the Universe. That craving can even become so strong that she might turn into a giant Rice Cake Bunny, and—oh boy!—you'd better keep your distance because she is going to wreak SWEET HAVOC. A group of particularly brave Cookies once tried to keep the giant Rice Cake Bunny in check by grabbing each other's hands and building a circle around her. Ever since, the Cookies have kept a tradition of holding hands and going around in circles under the full moon."
    },
    {
      "name": "Angel Cookie",
      "rarity": "Common",
      "class": "Healing",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Celestial Light",
        "description": "Blessed be the Cookies! Flies up in the air, restoring HP of all party members.",
        "effect": ["Healing: 50.0% of ATK"],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Angel_Cookie",
      "magic-skill": null,
      "bio": "Angel Cookie is trying to master the art of flying but can't rise higher than a teeny tiny bit above the ground just yet! Angel Cookie's favorite animals are penguins, ostriches, and baby chicks. Can you guess why? The Cookie's shiny golden curls are truly special. Not only do they grant their owner healing powers, they are remarkably lovely to look at!"
    },
    {
      "name": "Blackberry Cookie",
      "rarity": "Rare",
      "class": "Magic",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Ghost Servants",
        "description": "The ghosts rush through the enemy formation, striking them several times and increasing the party's Critical Strike Chance.",
        "effect": ["Single hit DMG: 17.0%"],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Blackberry_Cookie",
      "magic-skill": null,
      "bio": "Blackberry Cookie always wears a reserved look, but it would be hard to find a more caring and devoted Cookie. She has been working at one prestigious household for a long time, and is praised for her miraculous ability to do a multitude of tasks in virtually no time! Despite Blackberry Cookie's tightest schedule, she always finds the time to save the life of her venturesome employer. Perhaps, this is her main duty these days."
    },
    {
      "name": "Pancake Cookie",
      "rarity": "Rare",
      "class": "Ambush",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Take an Acorn!",
        "description": "Flies forward, throwing acorns at the enemies causing wide area damage and increasing the party's Attack Speed.",
        "effect": ["Single hit DMG: 40.0%"],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Pancake_Cookie",
      "magic-skill": null,
      "bio": "Browned to perfection, the ever-energetic Pancake Cookie is cute to the extreme. And he knows it! He even added a piece of butter on top of his head to look even more adorable. This sweet and innocent Cookie's favorite thing in the world is Acorn Jellies. When he sees one, he'll use the full extent of his cuteness to get his hands on it. You may try to resist his charms, but he'll get that Acorn Jelly from you one way or another!"
    },
    {
      "name": "Pomegranate Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Pomegranate Magic",
        "description": "Even dark spells can become a formidable ally! The Cookie's crimson magic applies a buff restoring some HP over time for the whole squad and increases Attack Power.",
        "effect": ["Healing: 17.4% of ATK every 1.0 sec over 5.0 sec"],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Pomegranate_Cookie",
      "magic-skill": null,
      "bio": "Dressed in her scarlet ceremonial attire with glittering pomegranate drop decorations, Pomegranate Cookie was raised in the lands of powerful sorcerers as a young priestess to the Sacred Pomegranate Tree. But when she was foretold to follow a great darkness, she started to doubt her upbringing. When an unstoppable dark force overran her homeland, Pomegranate Cookie already knew she had met her destiny, and gladly joined her mysterious new Master..."
    },
    {
      "name": "Poison Mushroom Cookie",
      "rarity": "Epic",
      "class": "Bomber",
      "location": "Middle",
      "type": "Poison",
      "skill": {
        "name": "Poison Cloud",
        "description": "Plants mushrooms that release purple poison clouds around themselves. Poisoned enemies become disoriented and suffer from a debuff reducing Healing, but Poison Mushroom Cookie claims that was never the intention... Poison clouds deal extra Poison DMG to monsters and bosses.",
        "effect": [
          "127.8% DMG",
          "Poison DMG: 25.0% DMG every 1.0 sec over 10.0 sec",
          "Extra DMG to regular enemies: 80.0%",
          "Extra DMG to bosses: 120.0%",
          "Healing: -15.0%"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Poison_Mushroom_Cookie",
      "magic-skill": null,
      "bio": "Some mushrooms are good for you, and some are not. Take the Purple Cap Mushroom, for example. Looks so chunky and yummy! That is why that hungry Cookie ate it. Why yes, that was Poison Mushroom Cookie. Always peaceful, always daydreaming. Poison Mushroom Cookie would be mistaken for an actual mushroom in the past, but they were never angry, never at all! Poison Mushroom Cookie greeted and hugged these mistaken Cookies like dear old friends, that's right! They offered every one of them a mushroom of their own- so sweet, so colorful. Just one bite, just one... After all, such big friendly eyes mean no harm. No harm at all..."
    },
    {
      "name": "Rye Cookie",
      "rarity": "Epic",
      "class": "Ranged",
      "location": "Rear",
      "type": "Fire",
      "skill": {
        "name": "Final Showdown",
        "description": "Shoot first if you don't wanna be shot! The Cookie aims both pistols at the enemy with the lowest Max HP (targets Cookies first) and shoots a round, dealing a great amount of damage several times. The Cookie's focus is so high, the Cookie will become resistant to interrupting effects. The Cookie's ATK SPD is increased greatly for the whole Showdown duration.",
        "effect": ["Single hit DMG: 72.0%"],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": "Rough Raw Rye",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Rye_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "On the sunset of a hard day's work, the saloon door bangs open. \"As usual, boss!\" she yells. Yup, it's Rye Cookie again, so better get her order straight. She's a bounty hunter in these here parts, sporting a shiny badge and all that. The Wild Gun, they call'er. Maybe she's here on a job, or maybe she's just moseying through town. Last time, there been rumors of a brazen heist: someone wiped the wheat silo clean as a whistle, not a single grain left. Wonder who coulda down that? Anyway, better to be careful 'round that one. It's safer to be nice and quiet 'round her, lest ya wanna feel the full barrel from her wholegrain-caliber."
    },
    {
      "name": "Espresso Cookie",
      "rarity": "Epic",
      "class": "Magic",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Grinding",
        "description": "Precise and even grinding is key for magically delicious coffee! A giant whirlwind inflicts periodic area damage to enemies and pulls them from afar to its center even if they are resistant to interrupts. The final burst of damage may interrupts skills. While Espresso Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": ["80.0% DMG over 7 hits", "100.0% DMG with last hit"],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": "Concentrated Espresso",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Espresso_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "Precise temperature, precise quantity of coffee beans, precise roasting time! Everything must be in an impeccably precise order for the plan to work. Always busy, always on the go—such is the lifestyle of the founder of the Coffee Magic school, Espresso Cookie. Despite being frequently mistaken for a black mage (yes, sometimes things burn and smoke), Espresso Cookie can't afford to waste a precious second on meaningless explanations. Night after night, this pioneer of magic works on perfecting his grind and brew. \"Isn't that too much coffee?\" one might wonder. Well, at least there's always the delightful coffee fragrance in the air!"
    },
    {
      "name": "Latte Cookie",
      "rarity": "Epic",
      "class": "Magic",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Care for a Latte?",
        "description": "Conjures a Latte Glyph attracting enemies to its center, dealing damage and silencing them. The Glyph remains on the ground, dealing damage over time and greater damage to enemies in its center. While Latte Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Single hit DMG: 60.0%",
          "Inner Latte Glyph DMG (total): 140.0%",
          "Outer Latte Glyph DMG (total): 105.0%",
          "Silence: 1.0 sec",
          "Immobilized: 5.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": "Bittersweet Latte",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Latte_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "Coffee or milk... that is the question. Why not both? Latte Cookie's dough was formed with coffee most bitter and acrid, balanced with the creamiest and smoothest blend of milk. With her etched staff in hand, she gracefully draws beautifully patterned Latte Glyphs in the air while daydreaming. But watch out! By chance, one of these Glyphs could be a powerful sigil for a grand spell! During her years as a student, she spearheaded research on the development of Coffee Magic with a rather eccentric aficionado of coffee. Thanks to her efforts, Latte Cookie was granted a professorship at the Parfaedia Magic Institute. You'd think that a professor would be more punctual, especially with their own lectures. But not Latte Cookie! She's more invested in savoring a warm latte before class. Though far from achieving the Professor of the Year Reward, she knows a thing or two about inspiring her students. With her genuine compliments and encouraging smile, Latte Cookie is the favorite professor of many."
    },
    {
      "name": "Almond Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Almond Handcuffs",
        "description": "Uses magical handcuffs to apprehend the enemy with the lowest max HP (targets Cookies first) and apply the Damage Link debuff, which disperses a portion of damage the apprehended enemy receives between up to five linked enemies (cannot be applied to summoned creatures). Cannot be interrupted.",
        "effect": ["Damage Link: 70.0%", "Duration: 3.0 sec"],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Almond_Cookie",
      "magic-skill": null,
      "bio": "Pristine coat. Perfect shirt. Combed hair. He always starts his day fresh, prim, and proper. But it never lasts long... After being dispatched to spells gone awry from alley to alley, it looks as if Almond Cookie has been on the job for days on end without a single break. If it isn't an enchanted grimoire moving on its own, it's some magical cauldron spewing Jellies without pause. Despite the chaos on every scene, the veteran detective solves each case by the book with pinpoint precision. The almonds in his dough give him a hardy, rough and tough crisp that can withstand just about anything thrown at him, but he's overworked to the point that his dough no longer contains the rich scent of almonds. \"Can't even get a coffee break,\" he sighs as another magical mishap needs his attention. With his coat fluttering in the wind, Almond Cookie looks upon his city and vows to keep going at it until he can finally relax with a decent coffee."
    },
    {
      "name": "Strawberry Crepe Cookie",
      "rarity": "Epic",
      "class": "Defense",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Crepe Thrust",
        "description": "Uses the giant crepe arms to cause area damage. Reduces DMG received by two allies (targets Cookies first) with the lowest Max HP.",
        "effect": ["Single hit DMG: 330.0%"],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Strawberry_Crepe_Cookie",
      "magic-skill": null,
      "bio": "Sweet strawberry cream, crispy waffles, and chubby fresh strawberries—is there a cuter combination? Meet Strawberry Crepe Cookie with an unyielding sparkle of curiosity in their eyes. And this curiosity is a force to be reckoned with: Strawberry Crepe Cookie will stop at nothing to find an answer to every question! Having grown up with Wafflebots, this Cookie preferred tinkering with robotic parts to playing with toys. This little genius's cute waffle headset is a tiny engineering marvel on its own. But don't touch it! Or you risk witnessing a change from the cute Strawberry Crepe Cookie to the furious one."
    },
    {
      "name": "Red Velvet Cookie",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Crimson Hand",
        "description": "Face the might of the Cakes! This Cookie grasps the rearmost enemy, brings it in front of the Cookie squad, dealing great damage and stunning them for a short time. Cannot be interrupted.",
        "effect": ["Single hit DMG: 835.0%", "Stun: 5.0 sec"],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Red_Velvet_Cookie",
      "magic-skill": null,
      "bio": "\"OBEY ME, MY BEASTS!\" Red Velvet Cookie's order, like a thunderbolt, rolls over the battlefield. \"FALL IN!\" And the horde of snarling Cake Monsters obediently assumes a dreadful battle formation. The crimson general personally leads his legion into battle, sowing fear with his clenched cake fist and his black eye gleaming with the dark fire of battle fervor. The battle-hardened warrior will see his mission to its end with precision and relentlessness. \"UNLEASH CHAOS, MY BEASTS!\" he roars as the battle begins. Adding silently: \"But please, come back alive...\""
    },
    {
      "name": "Fig Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Jelly Horn",
        "description": "The sound of Fig Cookie's Jelly Horn summons a flock of angered Fig Birds that swarm at the enemies, dealing damage. Surprised by this sudden attack, the enemies suffer from reduced ATK.",
        "effect": ["Single hit DMG: 221.0%", "-25.0% ATK for 7.0 sec"],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Fig_Cookie",
      "magic-skill": null,
      "bio": "If you ever go for a forest picnic on a bright sunny day when the fragrant wind caresses your cheeks, the curious Fig Cookie may shyly appear from behind the leaves! This Cookie is known to have dwelled in verdant forests of light and honey for a long, long time. Year after year, the forest awakens at the cheerful sound of Fig Cookie's Jelly Horn, and the brightest of flowers become more colorful and lively than ever. When Fig Cookie shares tales as old as the forest itself, animal friends gather around and listen intently. Prancing about to and fro, the Cookie sometimes ventures to the very edge of the forest to play and run with other Cookies."
    },
    {
      "name": "Mango Cookie",
      "rarity": "Epic",
      "class": "Magic",
      "location": "Middle",
      "type": "Water",
      "skill": {
        "name": "Mango Juice Wave",
        "description": "Sends forward a wave of tropical mango juice, inflicting damage to enemies. The fresh, sweet waves also increase the allies' ATK for a short time. While Mango Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": ["Single hit DMG: 57.0%"],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": "Ripe Mango Slice",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Mango_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "The sun glistens above the serene palm trees of the Tropical Soda Archipelago. Once you arrive, Mango Cookie will give you a cheerful, hearty welcome making you feel right at home! With ripe mangoes mixed straight into the dough, Mango Cookie is pure-spirited and tenderhearted. Whether it's spending time along the emerald coasts or exploring the islands with his canoe, Mango Cookie makes sure to enjoy life to the fullest. When the sun reaches its peak, sometimes he'll hang up his hammock underneath the shade of the palm trees and take a relaxing nap. When Cookies visit the archipelago, Mango Cookie can't help becoming a hyper chatterbox. Mangoes will ripen by the time he runs out of stories to tell!"
    },
    {
      "name": "Mala Sauce Cookie",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Fire",
      "skill": {
        "name": "Spicy Mala Strike",
        "description": "Strikes the ground with her mace, rupturing it and dealing area damage. Spicy Mala Sauce lava will erupt from the crack and apply the Burn debuff dealing periodic damage to the enemies. In addition, this skill increases the CRIT% of the two allies (Cookies come first) with the highest CRIT% stat.",
        "effect": [
          "Mace DMG: 9.0%",
          "Lava Burst DMG: 15.7%",
          "Burn: 27.6% DMG every 0.5 sec for 6 sec"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": "Mug of Mala Sauce",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Mala_Sauce_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "The blistering heat of the Dragon's Valley seems inhospitable to all forms of life. That is... until you get to know the spicy Cookies of the Mala Tribe. The entire tribe is unyieldingly spicy, but none come close to Mala Sauce Cookie with her mind-numbing, fiery taste! Her strength knows no bounds: a simple tap on a boulder shatter it to pieces, a full swing of her Morning Star Anise triggers a massive whirlwind. Due to her fierce determination to protect the tribe, she was the only cookie who succeeded in the dreaded Trial of the Dragon. It's no wonder that she is destined to be the future leader! Despite the twists and turns with her first adventure outside of the village, if she can captivate the spicy denizens of the Mala Tribe, the outside world doesn't stand a chance!"
    },
    {
      "name": "Frost Queen Cookie",
      "rarity": "Legendary",
      "class": "Magic",
      "location": "Middle",
      "type": "Ice",
      "skill": {
        "name": "Freezing Squall",
        "description": "Casts an ice squall, dealing damage, freezing all enemies, and applying the Frost debuff. Once Frozen, the targets' Cooldown will be paused and will receive an additional portion of damage when thawed. Targets resistant to Freezing receive only a portion of the DMG. If the Freeze debuff is dispelled, the targets will not receive the additional damage. Frost Queen Cookie herself is immune to freezing. While Frost Queen Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Single hit DMG: 67.8%",
          "Freeze Time: 2.0 sec",
          "Freeze DMG: 271.2% of ATK"
        ],
        "cd-start": 0,
        "cd-base": 18
      },
      "magic-candy": "Frost Queen Cookie's Life Jewels",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Frost_Queen_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "Somewhere amidst endless snow stands the lone castle of ice. In its halls of perpetual twilight dwells Frost Queen Cookie, the sovereign of winter itself. Like a fairytale queen, she dazzles with regal magnificence, yet her icy gaze leaves your soul cold and dreary, like tundra after a relentless blizzard. Her Cookie heart with all its mortal hopes and passions is long but frozen, all but one: her adamant will to accomplish her mission. A mission of utmost importance to the existence of the world. Ages might pass, but the castle of ice will remain: and so will Frost Queen Cookie, the guide for the myriads of Life-bearing snowflakes."
    },
    {
      "name": "Cocoa Cookie",
      "rarity": "Epic",
      "class": "Defense",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Cocoa is Love",
        "description": "Cocoa Cookie jumps into a giant cocoa mug and happily spins around for a given time, attacking the enemies. At the same time, Cocoa Cookie restores the HP for all allied Cookies except for summoned creatures and makes them immune to stunning. While Cocoa Cookie is using her skill, she will briefly become resistant to interrupting effects. Cocoa Cookie's regular attack will heal 3 allies (targets Cookies first) with the lowest HP.",
        "effect": [
          "Single hit DMG: 41.7%",
          "Healing: 42.8% of ATK",
          "Stun Immunity: 8.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Cocoa_Cookie",
      "magic-skill": null,
      "bio": "Even if her dough is 80% cocoa, she's always sipping hot cocoa, even during the summer time. Her marshmallow hat is so deliciously sweet, she needs to resist the temptation of taking a chunk out of it and dipping it into her cup. Her plump smooth cheecks just add to her charm! When she indulges in a freshly prepared cup of cocoa, all her worries melt away."
    },
    {
      "name": "Affogato Cookie",
      "rarity": "Epic",
      "class": "Bomber",
      "location": "Middle",
      "type": "Poison",
      "skill": {
        "name": "Sweet Scheme",
        "description": "Secretly curses the enemy with the highest ATK (targets Cookies first). The cursed target cannot receive any buff effects for a certain time (limited to buffs that can be dispelled). It will also receive amplified debuffs and will spread Poison inflicting periodic damage to nearby enemies and themselves. If Poison is dispelled, it will cause great damage to nearby enemies.",
        "effect": [
          "Curse: Target can't receive buffs for 10.0 sec",
          "Amplified Debuffs: 30.0% for 10.0 sec",
          "Poison: DMG every 0.6 sec for 10.0 sec, a total of 500.4% DMG.",
          "Area Poison: DMG every 1.0 sec for 10.0 sec, a total of 150.1% DMG.",
          "Poison dispelled: 300.2% DMG to nearby enemies"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Affogato_Cookie",
      "magic-skill": null,
      "bio": "One piping hot cup of dark roasted coffee and a frozen scoop of the sweetest vanilla ice cream! Born of two desserts—so different yet so delicious—Affogato Cookie's flavor is unparalleled! Neither coffee nor ice cream, Affogato Cookie spent restless years without a place to belong until he came up with a simple solution: to create a land of his own once and for all! He appeared out of nowhere on a frigid night in the Dark Cacao Kingdom and has been busy earning the trust and favor of the locals with the help of his strange concoctions and mysterious chants. These are troubling times for the Dark Cacao Kingdom and the throne is empty... What sinister intention is Affogato Cookie hiding behind his snide smile?"
    },
    {
      "name": "Clotted Cream Cookie",
      "rarity": "Super Epic",
      "class": "Magic",
      "location": "Middle",
      "type": "Light",
      "skill": {
        "name": "Consul's Orders",
        "description": "The Cloak of Light, a marvel of the Republic's cutting-edge technology, provides unquestionable advantages in battle. Upon using his skill, Clotted Cream Cookie projects the Light Cage onto the nearest enemy (targets Cookies first), blocking buffs and dealing area damage. The Light Cage cannot be dispelled and can be projected onto Cookies resistant to interrupting effects and prevents them from receiving removable buffs. The Light Cage will also inflict extra damage relative to the target's HP at the end of its duration. While Clotted Cream Cookie is using his skill, he will become resistant to interrupting effects. (DMG relative to Max HP is capped at 300,000)",
        "effect": [
          "Light Cage DMG: 189.0%",
          "Light Cage duration: 4.8sec",
          "Light Cage extra DMG: ",
          "Periodic DMG Duration: 1.4 sec, 22 ticks",
          "Total Periodic DMG: 308.5%"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Clotted_Cream_Cookie",
      "magic-skill": null,
      "bio": "Impeccable posture, perfect necktie knot, and a charming smile! Add a generous amount of filling: a mixture of cream, ambition, and respectability, and you will get the Republic's youngest Consul ever. Clotted Cream Cookie's first achievement in office was the consolidation of the Republic's fractured society. Even the Elders, whose authority in the city-state is unquestionable, recognize the Consul's brilliance and eloquence. Indeed, Clotted Cream Cookie's approval rating and influence are growing by the day! But beware: each of his sweet smiles is thoroughly calculated. This Cookie is always on the winning side."
    },
    {
      "name": "Crunchy Chip Cookie",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Wolf Squadron",
        "description": "Crunchy Chip Cookie's regular attacks leave the Claw Mark on the enemy with the highest ATK. Upon using the skill, the Cookie charges towards the enemies, slamming them and summoning his Cream Wolf. When Crunchy Chip Cookie is defeated, the Cream Wolf becomes enraged and continues fighting alone. In this state, the Cream Wolf becomes resistant to incapacitating effects. If Crunchy Chip Cookie is revived, he will hop back onto the Cream Wolf. Crunchy Chip Cookie and his wolves are less affected by Knockbacks and Flying. While Crunchy Chip Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": [
          "Tamer: receives 25.0% of Summoned Creature buffs",
          "Summoned Wolf: 70.0% of ATK, 60.0% of DEF, 85.0% of HP, 100.0% of CRIT%",
          "Tamed Wolf: 102.8% of ATK, 138.0% of DEF, 230.0% of HP, 100.0% of CRIT%",
          "Claw Mark: 30.0 sec, activated upon 3 stacks",
          "Claw Mark: removes buffs, ATK SPD -25.0% for 18.0 sec (stacks up to 2 times), 217.0% DMG"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Crunchy_Chip_Cookie",
      "magic-skill": null,
      "bio": "One howl is all it takes to prep the Cream Wolves for battle, even in the middle of the night. Led by Crunchy Chip Cookie, this elite squad protects the frozen borders of the Dark Cacao Kingdom. The squad captain may be famous for his quick temper—which is not surprising given the sheer amount of the crunchiest choco chips in his dough—but rest assured: Crunchy Chip Cookie is loyal and reliable, just like his white-maned wolf companion. His oath to his king has kept him and his comrades persevering through piercing winds and snowstorms to ensure the kingdom's safety from the Licorice Sea. No other squadron stands a chance against these ferocious warriors that race through the mountains on the backs of their wolves, defeating every monster they come across. Another Serene morning in the Dark Cacao Kingdom: perhaps, we have to thank Captain Crunchy Chip Cookie for it!"
    },
    {
      "name": "Financier Cookie",
      "rarity": "Epic",
      "class": "Defense",
      "location": "Front",
      "type": "Light",
      "skill": {
        "name": "Paladin Protection",
        "description": "Like a true Paladin of unfaltering belief, Financier Cookie protects an ally Cookie from the start of the battle until the moment she hits the ground. Financier Cookie's top priority is Clotted Cream Cookie, but if he is not present, she'll protect the allied Cookie with the highest ATK. Upon using her skill, Financier Cookie's regular attack will deal area damage, she will also heal herself, the Cookie she is protecting, increase their ATK, DMG and CRIT Resist, and grant them the Light's Shield. She will then deal area damage against her enemies. The Light's Shield will act as a Shield and deliver the Light's Judgment to those who dare to damage it when it disappears. While Financier Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Single hit DMG: 211.7%",
          "Healing: 43.5% of ATK, 65.3% of ATK if target is Clotted Cream Cookie",
          "DMG Resist: 20.0% for 15.0 sec",
          "CRIT Resist: 20.0% for 15.0 sec",
          "ATK Boost: 14.7% for 15.0 sec",
          "Light's Shield: 12.7% of the Cookie's Max HP for 5.0 sec",
          "Light's Judgment: fixed DMG of 50.0% of DMG received by the Light's Shield"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": "Buttery Financier",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Financier_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "Financier Cookie has the qualities of an exemplary Paladin: she is most humble and sincere when offering a prayer yet radiates confidence and power, wielding her sword. No other cadet of the Paladin Academy could parallel Financier Cookie's outstanding abilities—perhaps, she was meant to be chosen for the honorable position of the Republic Consul's personal bodyguard. A true Paladin does not flinch at an order: the greatest deeds perpetuating the order's glory are done by those who are not afraid of challenges, and Financier Cookie marches towards her goal with scrupulous and cold determination. But appearances can be deceiving: seek the Republic's most unfortunate, and they will tell you the Paladin's heart is full of kindness and compassion."
    },
    {
      "name": "Captain Caviar Cookie",
      "rarity": "Epic",
      "class": "Bomber",
      "location": "Middle",
      "type": "Water",
      "skill": {
        "name": "Black Shark Torpedo",
        "description": "Captain's orders! The Black Shark submarine will appear at Captain Caviar Cookie's call, shoot 3 Black Shark Torpedoes at the enemies, and grant all allies with Debuff Resist. Augmented with the latest technology of the Republic, the torpedoes will aim for the enemy with the lowest HP (targets Cookies first) in descending order. Once the torpedo hits the target, it will cause an explosion, dealing area damage and inflicting DEF Reduction. Captain Caviar Cookie is immune to any type of Fear, for he is a fearless sea wolf. While Captain Caviar Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": [
          "Torpedo's Target DMG (Cookies): 331.1%",
          "DMG (Others): 132.4%",
          "Torpedo's Area DMG: 195.7%",
          "Torpedo's Extra Area DMG (Summoned Creatures): 345.7%",
          "DEF -42.0% for 8.0 sec, stacks up to x1"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": "Bouncy Caviar",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Captain_Caviar_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "\"Don't ya dare fear the waves as long as you have a Captain in me!\" Captain Caviar Cookie's bellowing voice, louder than the squall itself, can inspire the most desperate and ragtag bunch of sailors! This sea wolf laughs in the face of gale and waves-after all, the very caviar in his dough was a gift of a tide much rougher. It is easy to mistake the ever frowning, sharp-toothed Cookie for a vile pirate, but make no mistake: this Cookie before you is a respected Elder, one of the Republic's most famed heroes, savior of Choco Mud Town, and the bane of all villains and monsters plaguing the seas. Captain Caviar Cookie's trusty ship, the Salty Shark, and its seasoned crew have weathered many a storm only to find a way out to a safe haven. What song will they sing today, sailing towards a new glorious adventure?"
    },
    {
      "name": "Black Pearl Cookie",
      "rarity": "Legendary",
      "class": "Ambush",
      "location": "Middle",
      "type": "Water",
      "skill": {
        "name": "Duskgloom's Sovereign",
        "description": "Dives into the abyss and shifts into her true form, creating a whirlpool storm that deals periodic damage and drags in even enemies resistant to interruptions. Enemies, terrified of the Cookie's giant size, suffer from Terror of the Abyss. If Terror of the Abyss is dispelled, the target will be inflicted with true damage proportional to the target's Max HP. Being the ruler of the abyss herself, Black Pearl Cookie is resistant to all Fear effects. (Maximum amount of damage proportional to the target's HP is 300,000)",
        "effect": [
          "Lightning DMG: 240.8%",
          "Whirlpool: 10 hits over 2.0 sec",
          "Single Hit DMG proportional to Max HP (Cookies): 6.3%",
          "Single Hit DMG (Others): 13.8%",
          "Lightning & Whirlpool DMG Reduction Bypass: 40.0%",
          "Healing received: -35.0% for 10.0 sec",
          "Terror of the Abyss: ATK SPD -20.0%, MOV SPD -20.0%, ATK -14.5% for 15.0 sec",
          "Terror of the Abyss Extra DMG:",
          "DMG proportional to Max HP (Cookies): 9.5%",
          "DMG (Others): 13.8%"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": "Black Pearl Cookie's Life Jewels",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Black_Pearl_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "\"There is something out there, hiding amidst the thick fog. Something ominous, capable of swirling all-consuming whirlpools and raising gigantic waves on a whim… The tale of Duskgloom Sea is true, you see, and its dark waters will reach every grain of sugar in your dough and silence your last scream…\" It will be wise to avoid these treacherous waves—for their ruler can toss and wreck even the mightiest of ships as if they were mere toys. It is said that kind-hearted mermaids once served as the ocean's caregivers and protectors, but here in the Duskgloom Sea, you will find only dark grudge(sic). Nobody knows the reason behind Black Pearl Cookie's century-old wrath, but with her on the underwater throne of wreckage, the Duskgloom Sea has gained its notoriety as the abyssal graveyard. She does not seek affection nor understanding, but then what is it that Black Pearl Cookie is looking for? What can pacify her cries of desperation?"
    },
    {
      "name": "Candy Diver Cookie",
      "rarity": "Rare",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Deep-sea Diver",
        "description": "While wandering the depths of the Duskgloom Sea, Candy Diver Cookie has become immune to enemy attacks by obtaining the Safeguarded ability. Their regular attacks reduce the DEF and increase DMG received by the nearest enemy. Upon using the skill, Candy Diver Cookie will discover various relics from the deep sea, providing buffs and healing to the Cookie's allies The super success rate will increase depending on Candy Diver Cookie's Amplify Buff rate. Every relic provides a different effect.",
        "effect": [
          "Regular Attack DEF Reduction: 7.5% for 10.0 sec, stacks up to 2 times",
          "Regular Attack DMG Boost: 5.0% for 10.0 sec, stacks up to 2 times",
          "Failed Super Success Carryover Rate: 15.0%",
          "Regular Relic HP Healing: 43.5%"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Candy_Diver_Cookie",
      "magic-skill": null,
      "bio": "Plop... Splash! Candy Diver Cookie pulls the lever on the wetsuit, and the two gumballs swirl a lap inside their helmet. Always out there, charting the unknown regions of the ocean floor, making sketches of fishes no one has ever seen, this deep-sea explorer might be tiny, but they leave an unforgettable first impression. Candy Diver Cookie has examined every underwater nook and cranny through the barnacled candy glass and probably witnessed whole coral forests grow and dissipate into pale dust that covers the soggy carcasses of sunken ships. All this curiosity, yet Candy Diver Cookie cannot find the answer to this one question: how does one end up all alone at the sea bottom? Whenever they try to catch onto the pieces of this mystery in the ocean of memory, they slip into the darker, deeper abyss."
    },
    {
      "name": "Macaron Cookie",
      "rarity": "Epic",
      "class": "Magic",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Mighty Macaron Parade",
        "description": "Following Macaron Cookie's exciting cheer, the Macaron Animals will start marching, dealing DMG to nearby enemies. Non-Cookie enemies will receive additional DMG. Her contagious enthusiasm will increase the ATK and CRIT% of her allies and restore their HP. Depending on the number of hits from the Macaron Animals, Macaron Cookie will gain a stack of the Happy Parade buff. Macaron Cookie will then restore the HP of her allies proportional to the number of stacks of Happy Parade once the parade is over. While Macaron Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Periodic Area DMG: up to 20 hits over a span of 5.0 sec",
          "Single Hit DMG (Cookies): 28.5%",
          "Single Hit DMG (Others): 45.0%",
          "After every 5 hits, a single enemy receives 5.0% less DMG (does not go below -20.0% of DMG)",
          "Healing: 5.8% of ATK every 1 sec for 5 sec"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Macaron_Cookie",
      "magic-skill": null,
      "bio": "Did you think this Cookie was made with artificial food coloring? Guess again! She is made with 100% all-natural ingredients. Even her long, gorgeous eyelashes are completely organic. Cookies are drawn to her friendly smile and gentle voice. In fact, cute little Macaron Animals love to gather around her too. Once she starts playing on her macaron drum, the Macaron Animals start a tiny parade. At times, the parade can get out of hand, but Macaron Cookie still enjoys the company anyway. When she gets really excited, Macaron Cookie may demonstrate her most festive performance for you."
    },
    {
      "name": "Milky Way Cookie",
      "rarity": "Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Sugarcloud Express",
        "description": "Milky Way Cookie jumps onto her dream train, gaining a DMG Reduction buff and providing a Stun Resistance buff for the entire team. Then she will push back the enemies several times, applying a DEF Reduction debuff and dealing damage. Once she's done with her shift, Milky Way Cookie will cast a Shield onto herself and the rest of the team. While Milky Way Cookie is using her skill, she will briefly become resistant to interrupting effects. Being a dweller of the World of Dreams, Milky Way Cookie is not susceptible to the Beckoning Dreams & Dream of Doom effect.",
        "effect": [
          "Regular Self-healing: 57.7% of ATK",
          "Locomotive Charge Extra DMG when target has Shield:",
          "Single Hit DMG (Cookies): 114.1%",
          "Single Hit DMG (others): 38.0%",
          "Stun Resist: Stun duration -50.0% for 10.0 sec",
          "HP Shield (self): blocks 20.0% of Max HP for 3.0 sec",
          "HP Shield (allies): blocks 15.5% of Max HP for 3.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Milky_Way_Cookie",
      "magic-skill": null,
      "bio": "Take a handful of star powder gathered from all over the Milky Way Galaxy, illuminate it with delicate moonlight—and voila! Meet Milky Way Cookie, the Slumbering Moon's faithful servant and the conductor of the Sugarcloud Express that will take you to your sweetest dreams and back. Don't be afraid and hop on: one sprinkle of Milky Way Cookie's star powder is enough for a colorful, vibrant dream-just like reality but better! Everything is possible in the World of Dreams, and accidents happen, too: every now and then, the train's floor disappears, and cars reshuffle randomly, leaving crowds of passengers in utter confusion. And right in the middle of the conductor's scheduled nap time! But professionalism never betrays, and there is no problem Milky Way Cookie can't sort out. Colorful hair neatly tied with a Star Jelly, conductor's hat on, and choo choo! The Sugarcloud Express will deliver you to your dreamy destination according to the schedule. Just make a wish upon a twinkling star...!"
    },
    {
      "name": "Moonlight Cookie",
      "rarity": "Legendary",
      "class": "Magic",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Dream of the Night Sky",
        "description": "Moonlight Cookie falls asleep in the night sky and dreams a dream where stars fall onto the enemies' heads, dealing damage and applying a DMG Increase debuff. Then, bright moonlight illuminates the battlefield, dealing damage to the enemies and putting them to Sleep. Enemies that didn't fall Asleep become Drowsy and will eventually fall Asleep when their resistance statuses wear off. When Moonlight Cookie awakens, she will restore her own HP. She will also restore her own HP upon awakening from Sleep effects cast by enemies. Being a dweller of the World of Dreams, Moonlight Cookie is not susceptible to the Beckoning Dreams & Dream of Doom effect. (DMG relative to Max HP is capped at 300,000)",
        "effect": [
          "Additional Starlight DMG: 5.5% of Max HP (Cookies)",
          "Starlight ignoring DMG Resist: 40.0%",
          "Moonlight DMG",
          "Drowsiness: ATK SPD -15.0%, MOV SPD -15.0% for 15.0 sec",
          "Self-healing: 29.8% of ATK"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Moonlight_Cookie",
      "magic-skill": null,
      "bio": "Moonlight Cookie's graceful wavy hair shines under the night sky, elegant and mystical as ever. She was created by the ancient wizards and learned the secrets of the City of Wizards. Now, all the wizards are gone and she is the only one left to protect the city. She is strongest while in her dreams, therefore is able to protect the city from intruders. Whenever she feels sad, she falls asleep, where she is able to lean by her friend Moon and draw in the night sky with her Star friends to cheer up."
    },
    {
      "name": "Pure Vanilla Cookie",
      "rarity": "Ancient",
      "class": "Healing",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Love & Peace",
        "description": "Illuminates the battlefield with his Vanilla Orchid Staff, granting Amplify Buffs to regular healing targets. The light reaches all corners of the battlefield, replenishing the party's HP and reducing the effects of Injury. Pure Vanilla Cookie heals the amount of HP proportional to the reduction of Injury's effects. He then casts an HP Shield absorbing an amount of damage proportional to their Max HP. If the Shield is removed or the target cannot receive it, Pure Vanilla Cookie instead grants a buff that restores HP over time. While Pure Vanilla Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": [
          "Healing: 99.4% of ATK",
          "Shield: absorbs 20.0% of max HP for 3.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 19
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Pure_Vanilla_Cookie",
      "magic-skill": null,
      "bio": "There are not many Cookies on Earthbread who could inspire hope as Pure Vanilla Cookie did. Born from nature-blessed cream and a fragrant vanilla bean, he was the epitome of Cookie kindness and faithfulness. Pure Vanilla Cookie strived to forgive the wrongdoer and heal the wounds of Cookies and animals alike. Though a powerful wielder of magic, he would use his spells not for his own good, but for the good of everyone. The Cookie took an arduous pilgrimage down the Sugar-Free Road. What Pure Vanilla Cookie learned through the Trials is unknown, but crowned with a bright halo of light he returned to found the Vanilla Kingdom, a land of freedom and learning, and a beacon for those seeking love and peace. Pure Vanilla Cookie stood by his friends until the very end, warding off the Darkness with a heartfelt smile."
    },
    {
      "name": "Blueberry Pie Cookie",
      "rarity": "Epic",
      "class": "Magic",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Cursed Tome",
        "description": "An evil spirit appears from the Tome, dealing damage to the enemies and inflicting them with the Greed of the Tome debuff. It will also heal Blueberry Pie Cookie’s HP and increase her DMG Resist. The Tome will gain a stack of Greed whenever the spirit deals damage to Cookies, or the target inflicted with the Greed of the Tome debuff becomes incapacitated. Once the Tome has enough stacks of Greed, it will unleash its Sealed Power, increasing Blueberry Pie Cookie's ATK and dealing DMG to the enemies. While Blueberry Pie Cookie is using her skill, she will briefly become resistant to interrupting effects. (DMG relative to Max HP is capped at 300,000)",
        "effect": [
          "Magic Tome DMG: 134.6% of ATK",
          "Healing: 115.0% of ATK",
          "Greed: Sealed Power triggers upon x7 stacks",
          "Sealed Power DMG",
          "Cookies: For 1.5 sec, hits up to 6",
          "Others: For 1.5 sec, hits up to 6",
          "Single hit DMG: 17.7%"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Blueberry_Pie_Cookie",
      "magic-skill": null,
      "bio": "Somewhere within the abandoned and silent City of Wizards, a lone Cookie remains in the towering Archives. Blueberry Pie Cookie has kept watch over the Wizard Archives' dangerous tomes for countless years. Following her destiny, she continues to organize the endless shelves day by day. On a dark moonless night, when an oath to the Wizards had faded away with the light, Blueberry Pie Cookie's curiosity got the better of her: she opened and read one of the forbidden tomes... As days and nights of caretaking the Archives pass, she takes solace in a slender beam of moonlight that creeps in through a small window. Was forsaking an oath too much for a Cookie to handle?"
    },
    {
      "name": "Capsaicin Cookie",
      "rarity": "Super Epic",
      "class": "Charge",
      "location": "Front",
      "type": "Fire",
      "skill": {
        "name": "Capsaicin Magma",
        "description": "Capsaicin Cookie transforms with the surge of magma power. When he has transformed, his regular attacks will cause Lava Eruptions, inflicting Burn and Magma debuffs to enemies. While transformed, Capsaicin Cookie will briefly become resistant to interrupting effects. After his transformation, Capsaicin Cookie will enter Spice Overlord mode with all the intense magma power and deliver his final strike. If Capsaicin Cookie is defeated for the first time, he will become Immortal, dispelling his debuffs and cannot be defeated for a certain period. The first cooldown of Capsaicin Cookie's skill will be shortened, allowing for faster skill use.",
        "effect": [
          "Single Hit DMG: 32.4% of ATK",
          "Lava Eruption DMG: 97.2% of ATK",
          "Burn DMG: 27.3% DMG every 1.0 sec for 16.0 sec, stacks up to x2",
          "Spice Overlord DMG: 362.4% of ATK",
          "Spice Overlord Burn DMG: 54.6% DMG every 0.8 sec for 16.0 sec, stacks up to x1",
          "Immortality: lasts for 6.0 sec, activated 1 time"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Capsaicin_Cookie",
      "magic-skill": null,
      "bio": "I'll show you the true meaning of SPICE!!! What is this voice, rumbling more intensely than an erupting volcano?! It's none other than Capsaicin Cookie! This Cookie is a product of a fiery mix of capsaicin, the essence of spice, and burning hot magma. Perhaps that's why Capsaicin Cookies's personality, behavior, and strength are all super explosive. It's no surprise that he gained a reputation as the strongest Cookie as soon as he enrolled in Scovillia, a school for only the spiciest of Cookies. Despite his wild exterior, this cookie has won the hearts of every cookie around him with the burning sincerity buried deep in his magma heart. The name Spice Overlord and his now-melted shackles were once a reminder of his pained past, but fear not! Capsaicin Cookie will never lose himself as long as he's able to face his own spice!"
    },
    {
      "name": "Prune Juice Cookie",
      "rarity": "Epic",
      "class": "Bomber",
      "location": "Middle",
      "type": "Poison",
      "skill": {
        "name": "Prune Juice Potion",
        "description": "For Prune Juice Cookie's regular attack, he throws a Prune Juice Bottle at the farthest enemy, poisoning the target and nearby enemies. Upon using his Skill, Prune Juice Cookie will throw a giant Prune Juice Bottle containing poison. When the bottle shatters, it will inflict Poison DMG Boost, Sticky Goo, Poison, and summon Prune Jellies. The HP of summoned Prune Jellies are reduced by the number of hits. Summoned Prune Jellies will spread Prune Gas from time to time, poisoning nearby enemies. Summoned Prune Jellies are consisted of poison, immune to any kind of periodic effects and are not affected by Shield or Healing.",
        "effect": [
          "Prune Juice Poisoning: 76.9% DMG every 2.0 sec for 10.0 sec",
          "Giant Prune Juice Poisoning: 49.0% DMG every 1.0 sec for 10.0 sec",
          "Sticky Goo: Sticky Goo debuff will be dispelled instead of other debuffs for 15.0 sec. Stacks up to x1",
          "Prune Jellies: 95.0% of ATK, withstands 30 hits",
          "Prune Jellies Poisoning: 45.9% DMG every 2.0 sec for 20.0 sec",
          "Prune Jellies Prune Gas Poisoning: Activated every 3.0 sec, 36.7% DMG every 2.0 sec for 20.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Prune_Juice_Cookie",
      "magic-skill": null,
      "bio": "When you smell the fragrant yet subtle scent of plums across the door at the top of the endlessly spiraling staircase, you know Prune Juice Cookie is brewing his magic potions! This Cookie, made from the richest and most potent prune juice, is the best potion maker at the Parfaedia Institute. His potions are amazingly effective-just a single sip will have you feeling the dizzying effects! They say that his outstanding talent is not the sole reason he picked the efficient minimalistic art of potions over fancy, sweet dessert magic... But perhaps it's not so smart to snoop around the genius potion maker, as his charms and theatrics will persuade you to buy all of his potions! Even if you don't understand his true intentions, the effort he puts into his potion-making is evident in the ever-boiling cauldron and notebooks covered in potion stains."
    },
    {
      "name": "Rockstar Cookie",
      "rarity": "Epic",
      "class": "Healing",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Legend of Rock",
        "description": "Rockstar Cookie performs a rock anthem, periodically Healing the team's HP and applies the Legendary Rock Spirit buff, Curse Protection buff, and a CRIT% buff for the whole team excluding himself based on his CRIT% boost from equipped Toppings. Under Legendary Rock Spirit, the target will have their HP restored whenever they deal a critical hit. If Rockstar Cookie is defeated for the first time, he will have all active debuffs on himself removed and begin his Encore. During Encore, Rockstar Cookie will provide extra Healing and increase the Healing the team receives. While Rockstar Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": [
          "Healing: 17.0% every 1.0 sec for 7.0 sec",
          "Bonus Healing (Encore): 30.9% every 0.1 sec for 1.8 sec"
        ],
        "cd-start": 0,
        "cd-base": 15
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Rockstar_Cookie",
      "magic-skill": null,
      "bio": "Whaaaaam! Wacka wow! Inside the sizzling oven, Rockstar Cookie discovered the sound of rock 'n' roll. He realized that to move the audience, one must not only be talented but also feel the true Rock Spirit within! Many legendary hits were created with that philosophy in mind. Every Cookie who has seen Rockstar Cookie perform was changed forever. The blazing sound! The overwhelming charisma! The legend might have taken a path different from his earlier days filled with experimentation, but his Rock Spirit still resonates with everyone!"
    },
    {
      "name": "Alchemist Cookie",
      "rarity": "Rare",
      "class": "Bomber",
      "location": "Middle",
      "type": "Poison",
      "skill": {
        "name": "Unstable Formula",
        "description": "Begins researching a poison formula that, thrown at the enemies, causes periodic damage. Alchemist Cookie's research consists of three stages: the higher the stage, the wider the effect area, and the greater the amount of damage. After reaching the third stage, the Cookie throws the formula automatically.",
        "effect": [
          "Stage 1: 53.3% DMG, 9.5% Poison DMG every sec over 10 sec",
          "Stage 2: 108.1% DMG, 19.5% Poison DMG every sec over 10 sec",
          "Stage 3: 163% DMG, 29.5% Poison DMG every sec over 10 sec"
        ],
        "cd-start": 0,
        "cd-base": 16
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Alchemist_Cookie",
      "magic-skill": null,
      "bio": "Made from the freshest of grapes, the fruit of the gods, this smart Cookie cares only about one thing: Research! She is always doing wild calculations, trying to figure out how to transform the elements. And she knows that being lazy or sitting idly by will achieve nothing. In order to acquire something of value, one must give something of value in return—that's Alchemist Cookie's theory, at least."
    },
    {
      "name": "Cherry Cookie",
      "rarity": "Rare",
      "class": "Bomber",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Huge Cherry Bomb",
        "description": "A giant cherry bomb causes area damage and stuns enemies.",
        "effect": ["Single hit DMG: 146.0%", "Stun: 2.0 sec"],
        "cd-start": 0,
        "cd-base": 16
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Cherry_Cookie",
      "magic-skill": null,
      "bio": "Behind her endearing smile and adorable looks, Cherry Cookie hides a destructive nature. A real troublemaker decorated with bright red cherry syrup, she enjoys pulling destructive pranks. She especially enjoys throwing her Cherry Bombs, which explode like fireworks. Believe it or not, the sweet, invigorating smell of cherry black powder in the air can blow any stress away!"
    },
    {
      "name": "Custard Cookie III",
      "rarity": "Rare",
      "class": "Healing",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "King's Favor",
        "description": "Heals two Cookies with the lowest HP and also casts a short-living HP Shield. 'Cause that's what kings do!",
        "effect": [
          "Healing: 113.0% of ATK",
          "Shield: absorbs 10.0% of max HP for 3.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 16
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Custard_Cookie_III",
      "magic-skill": null,
      "bio": "Even before the custard on his head started to take shape, this little Cookie dreamed of becoming a glorious king, worth of the title borne by the greatest rulers of the past. Custard Cookie III, as he prefers to call himself, may not rule anything yet, but looking at how active he is at waving his scepter and giving orders, it is only a matter of time before he sits on a real throne. And his determination is remarkable! Made of simple colored paper, his royal regalia looked so realistic that even the notorious Chili Pepper Cookie got confused once! These days, Custard Cookie III is busy recruiting supporters to witness his future crowning. Perhaps you could become one of them?"
    },
    {
      "name": "Mint Choco Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Battlefield Symphony",
        "description": "Restores some HP and increases Attack Speed of the squad with a sublime melody.",
        "effect": ["Healing: 95.0% of ATK"],
        "cd-start": 0,
        "cd-base": 16
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Mint_Choco_Cookie",
      "magic-skill": null,
      "bio": "His exquisite performance and dashing looks make him a favorite among the Cookies. His Mint Candy Violin gives off a sweet enchanting candy aroma while he plays. Though often called a genius, he refuses to let all this attention go to his head and never forgets his long years as a humble street performer."
    },
    {
      "name": "Cream Puff Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Jellius Extremus!",
        "description": "Conjures a tornado of Jellies over a large area, causing area damage and restoring the party's HP. The spell cannot cause CRIT DMG, but instead, there is a chance to conjure it with great success depending on the CRIT%. Cast with great success, the spell will inflict greater DMG and heal a greater amount of HP. While Cream Puff Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Single hit DMG: 469.5%, Successful spell: 1166.8%",
          "Healing: 103.5% of ATK, Successfull spell: 238.6% of ATK"
        ],
        "cd-start": 0,
        "cd-base": 16
      },
      "magic-candy": "Puffy Little Cream Puffs",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Cream_Puff_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "Sweet Cream Puff Cookie makes you feel delighted just by looking at her. Made of soft and delicate cream puff, this cookie is as fragile as can be. Something always makes you worry about her, but it's certain that great power sleeps within her. Cream Puff Cookie used to study magic on her own, but now she is a graduate of a prestigious Magic Academy! Will Cream Puff Cookie be able to become a famous wizard? Let's find out!"
    },
    {
      "name": "Squid Ink Cookie",
      "rarity": "Epic",
      "class": "Magic",
      "location": "Middle",
      "type": "Water",
      "skill": {
        "name": "Ink Tentacle Slap",
        "description": "Where did Squid Ink Cookie go? And what is this giant squid doing here?! The monster is about to make anyone flat as a Cookie with a series of rapid slaps dealing area damage.",
        "effect": ["Single hit DMG: 35.0%"],
        "cd-start": 0,
        "cd-base": 16
      },
      "magic-candy": "Ink-stained Coins",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Squid_Ink_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "Squid Ink Cookie came out of the oven not even a little bit crispy. Maybe that's because of all the viscous ink inside! The Cookie was found floating along the seashore, all weak and confused. There is a theory that this Cookie is the legendary treasure-eating sea monster that attacked treasure ships, hungry for more gold. But Squid Ink Cookie can't remember anything of that and spends all the time oozing blackish inky tears."
    },
    {
      "name": "Sonic Cookie",
      "rarity": "Special",
      "class": "Ambush",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Sonic's Spin Dash",
        "description": "Curls up into a ball, spinning rapidly and bursting forward at super speed, dealing DMG to each enemy hit in succession. Increases ATK SPD of all allies.",
        "effect": ["Total DMG: 201.9%"],
        "cd-start": 0,
        "cd-base": 16
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Sonic_Cookie",
      "magic-skill": null,
      "bio": "Green hills, labyrinths of mystic caves, or risky loop-de-loops-nothing can stop Sonic, for he is the fastest hedgehog EVER! Amazing, huh? While Sonic might not care much about rules and all, he will stop at nothing to help a friend in need. Time to meet Sonic the Hedgehog, a hero running at super speeds to save the world! In his own way."
    },
    {
      "name": "Twizzly Gummy Cookie",
      "rarity": "Epic",
      "class": "Ranged",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Twizzly Beam",
        "description": "Twizzly Gummy Cookie overloads her Electrojelly Gun and fires a powerful electrifying laser beam. While Twizzly Gummy Cookie is using her skill, her CRIT DMG is increased and enemies hit by her laser beam will be Zapped. This is a non-stackable debuff that deals periodic damage and temporarily disrupts HP Shields. While Twizzly Gummy Cookie is charging her laser, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Single hit DMG: 7.7%",
          "Single hit DMG: 4.6%",
          "Zap: 2.8% DMG every 1.0 sec for 7.0 sec.",
          "Nullifies HP Shield."
        ],
        "cd-start": 0,
        "cd-base": 16
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Twizzly_Gummy_Cookie",
      "magic-skill": null,
      "bio": "Would you look at that? Gummy wires twisted here and there, sparks flying everywhere! Maybe that's why Twizzly Gummy Cookie's temperament is like chaos itself! She insists that if she doesn't wreak havoc even for one day, her hair will start crackling electricity! *BZZZZT* With her ticking time bomb of a Electrojelly Gun, she will bulldoze a planet and pulverize the planet right next to it! No wonder they call her the Cosmic Criminal—look at her cause absolute mayhem everywhere she lands! To her, battles are just another game that gives her electrifying thrills. Looks like she's done messing with her universe and ready to jump to another dimension! Just what could she be plotting next? Her evil cackling and rampaging sparks can't be good news... Well, good luck to those who come in her way... because it's gonna hurt!"
    },
    {
      "name": "Eclair Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Book of History",
        "description": "With all the knowledge and research accumulated over the years, analyzes and identifies the opponent's weakness. Casts 'Weakness' debuff to 3 enemies with the highest ATK (targets Cookies first), amplifying the DMG they receive, and deals DMG. If the enemy is defeated while under the Weakness debuff, all allies gain an HP shield.",
        "effect": ["Single hit DMG: 480.6%"],
        "cd-start": 0,
        "cd-base": 16
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Eclair_Cookie",
      "magic-skill": null,
      "bio": "When you're looking around the museum, taking a look at the ancient relics that hold mysteries and stories untold, it feels as if the whole world has grown peaceful and silent. That's usually when the curator of this museum will approach you with a gentle and kind greeting. Eclair Cookie, at your service! With an entire dessert covered in premium fondant icing adorning his hat, he'll greet guests of the museum with elegance and grace, all while making sure there's no trace of dust to be found. But it must be said that he tends to go overboard with his explanations whenever a guest shows interest in his favorite topic: dragon-fighter Cookies! Which is precisely why he's mostly seen in his office, writing reports on these brave and heroic dragon-fighter Cookies. He may be sitting in front of his desk, but do not underestimate his scholarly heart—for his passion for history burns bright as any other adventurer exploring this world."
    },
    {
      "name": "Dark Cacao Cookie",
      "rarity": "Ancient",
      "class": "Charge",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Solemn Judgment",
        "description": "Swings the Grapejam Chocoblade with great force, causing thunder and lightning to inflict damage upon foes in range. This mighty attack reduces enemies' ATK, DEF, and inflicts Zap and Injury. Injured foes will have reduced Max HP, and the Injury debuff ignores immunity and dispelling effects not mentioning Injury specifically. While Dark Cacao Cookie is using his skill, he will briefly become resistant to interrupting effects.",
        "effect": [
          "First hit DMG: 46.9%",
          "Second hit DMG: 265.8%",
          "-15.0% DEF for 9.0 sec",
          "-10.8% ATK for 9.0 sec",
          "Injury: 12.5% Max HP Reduction for 30.0 sec (from the start of battle), Injury limit up to 25%",
          "Zap: 3.0% DMG ervery 1.0 sec for 9.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 16
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Dark_Cacao_Cookie",
      "magic-skill": null,
      "bio": "The last bean, devoid of any sweetness, fell down from a withered branch of a lonely cacao tree growing above the edge of a cliff. Lying there in frozen soil, enduring snow and wind, this bean wasn't aware of its destiny to become the main ingredient for the cold and reclusive Dark Cacao Cookie. A warrior of unheard strength, Dark Cacao Cookie wielded the Grapejam Chocoblade. This sword was so heavy it required three average Cookies to even budge it. With each swing, the skies erupted into thunder and lightning, avalanches tumbled down countless mountains. Dark Cacao Cookie was known as a Cookie of few words but great principle. After the Dark Flour War's sorrowful events, the warrior locked himself away in the solitude of his own castle... Will anything be able to melt his frozen soul once again?"
    },
    {
      "name": "Carol Cookie",
      "rarity": "Epic",
      "class": "Healing",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Magic Songs",
        "description": "Sings the Song of Joy to restore the team's HP and increase their CRIT% and CRIT DMG. When only two or fewer Cookies are left, including Carol Cookie, switches to the Song of Change instead, having her Cooldown immediately reset and decreased for the remainder of the battle. The Song of Change damages the enemies, increases the team's CRIT% and CRIT DMG, and reduces the Cooldown for the remaining team members. With each regular attack, Carol Cookie sings the Song of Energy and restores the entire team's HP. However, the fewer team members she needs to heal, the more healing each individual member will receive. While Carol Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Healing: 82.4% of ATK",
          "Song of Change DMG: 180.4%",
          "Ally Cooldown: -2.5 sec"
        ],
        "cd-start": 0,
        "cd-base": 16
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Carol_Cookie",
      "magic-skill": null,
      "bio": "This gentle Cookie believes that the song is stronger than the sword! She knows how to exert great power with beautiful poetry and melodies only. \"No matter what happens, I will always have my songs. My Song of Love will always be around, my Song of Peace will cast darkness away, and my Song of Comfort will bring a smile to a tired face!\""
    },
    {
      "name": "Linzer Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "The Culprit... is YOU!",
        "description": "Linzer Cookie gains Deduction stacks instead of regular attacks. Upon using her skill, she increases the CRIT% of her allies and applies the Suspect debuff to the enemy with the highest ATK, dealing damage to the target and area damage to the enemies nearby. The Suspect debuff is enhanced with Deduction stacks, and when using the skill with the maximum number of stacks, the debuff will decrease the target's DEF and apply a CRIT DMG buff for allies. The renowned writer's impeccable deduction allows the Suspect debuff to be applied even to targets with debuff immunity. While Linzer Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": ["Deduction: stacks up to x7", "Area DMG: 433.6% of ATK"],
        "cd-start": 0,
        "cd-base": 16
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Linzer_Cookie",
      "magic-skill": null,
      "bio": "Who is that tall, elegant lady wearing a fashionable pillbox hat? Why, the world-famous mystery novelist Linzer Cookie, of course! Writing an excellent detective story is like cooking a gourmet dessert: it takes a time-proven recipe of undeniable facts, an array of scrumptious plot twists, a decadent, visceral, plentiful filling of sweet suspense, but, first and foremost, the author's impeccable craftsmanship and passion. And the overwhelming popularity of Linzer Cookie's books proves she has it all: each new release means a long queue of faithful fans waiting by the bookstore from the early hours. Betting on the culprit's identity, trying to solve the sinister riddles... it's a cult following! Of course, Linzer Cookie never reveals her secrets: with her trusty pen and the signature glint in her eye, the star writer is already working on a new manuscript, stained with a few drops of strawberry jam..."
    },
    {
      "name": "Clover Cookie",
      "rarity": "Rare",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Bard's Song",
        "description": "Tough times are when music is needed the most. The Cookie plays a soothing song, removing all debuffs from party members and applying a buff that slowly restores their HP.",
        "effect": [
          "Healing: 12.0% of ATK every 1.0 sec over 5.0 sec",
          "Purify: all debuff effects"
        ],
        "cd-start": 0,
        "cd-base": 17
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Clover_Cookie",
      "magic-skill": null,
      "bio": "A brightly sunlit summer glade covered with soft clovers. A forest brook murmuring gently not afar. A delicate breeze whispering secrets to your ear. A joyful bustle of a Cookie crowd. Clover Cookie wanders the land in search of inspiration for his poetry of the everyday. Two crunchy feet and a long road ahead, the old grass-woven lute behind his back, and someone to sing a song to—what else is needed to be happy? Sing along, and Clover Cookie's ballad will flow far away, over the forests and ridges of the Cookie World."
    },
    {
      "name": "Herb Cookie",
      "rarity": "Epic",
      "class": "Healing",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Sunny Garden",
        "description": "Turns the ground into a wonderful little garden, removing all debuffs and restoring some HP for the whole party. Standing near sprouts also restores some HP over time.",
        "effect": [
          "Healing: 47.2% of ATK",
          "Healing: 9.0% every 1.0 sec over 5.0 sec when standing near sprouts",
          "Purify: all debuff effects"
        ],
        "cd-start": 0,
        "cd-base": 17
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Herb_Cookie",
      "magic-skill": null,
      "bio": "Warm like the sunshine and fresh like the scent of rain, Herb Cookie will ease your mind when you're feeling down. Made of fresh green herbs, this Cookie may not be to everyone's taste. On rainy days, Herb Cookie loves to listen to the sound of falling raindrops under his trusty leaf umbrella. On warm days, he enjoys the sunshine together with his favorite plants. This Cookie treats all living things and every moment as precious. He believes that the little things that make you laugh or cry are to be cherished, just like a ray of sunshine after the rain."
    },
    {
      "name": "Sea Fairy Cookie",
      "rarity": "Legendary",
      "class": "Bomber",
      "location": "Middle",
      "type": "Water",
      "skill": {
        "name": "Soaring Compassion",
        "description": "Fires a stream of water, inflicting damage and stunning 5 closest enemies (targets Cookies first). After a certain time, a full moon-shaped pool of water created underneath the targets bursts up with the power of eternity, dealing heavy damage.",
        "effect": [
          "Water Stream DMG: 150.0%",
          "Water Pillar DMG: 173.0%",
          "Stun: 3.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 17
      },
      "magic-candy": "Sea Fairy Cookie's Life Jewels",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Sea_Fairy_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "Sea Fairy Cookie was frozen under a curse long ago. But perhaps because of her grieving heart, her soul was frozen beyond magic. If it weren't for the warm kindness of our Cookies, she might have chosen to stay frozen forever. Beyond her flowing hair, the twinkle in her eyes still states she is willing to fight her fate. Let's hope she does not let go of her sword, giving up hope and choosing to turn into sea foam."
    },
    {
      "name": "Parfait Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Para-Paru-Parfait!",
        "description": "Grabs the microphone and belts her heart out. Touched by the earnest and sincere song, all allies will recover some HP and receive a buff that increases DEF and resistance to debuffs. While Parfait Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Healing: 14.4% of ATK every 1.0 sec over 7.0 sec",
          "Debuff Resist: 40.0% for 7.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 17
      },
      "magic-candy": "Colorful Parfait",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Parfait_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "In a time when there's never a day without a new hot celebrity idol, this singer-songwriter Cookie desperately tries to stick out with sweet toppings in vivid colors! Parfait Cookie's distinct style involves layers of chocolate and candy, topped with dripping syrup. Despite still being a rookie, this Cookie already has dozens of self-written songs. Parfait Cookie's melodies may be just as creative and unique as her colorful mixture of toppings, but her lyrics are always as pure and honest as vanilla ice cream. \"It doesn't matter if the audition goes bad, if no one recognizes me, or even if my toppings melt in the summer rain! I keep playing my guitar and sing about the truth in my heart.\""
    },
    {
      "name": "Tails Cookie",
      "rarity": "Special",
      "class": "Ambush",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Tails' Spin Dash",
        "description": "Tails curls up into a ball and dashes towards his enemies, dealing DMG to each enemy hit in succession. Upon landing, increases DEF of allies.",
        "effect": ["Total DMG: 202.5%"],
        "cd-start": 0,
        "cd-base": 17
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Tails_Cookie",
      "magic-skill": null,
      "bio": "Tails is a very special fox. Why? Because he can fly thanks to his two tails! Tails wasn't always happy about being different, but with Sonic's help, he has gained the courage to accept himself. Of course, now the two are the best friends in the world! Tails knows his way around tools, mechanisms, and robots—that's for sure. This little genius is always working hard, tinkering on new inventions to help save the world!"
    },
    {
      "name": "Cotton Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "A Warm Light",
        "description": "While Cotton Cookie's lantern shines, the warm light will periodically restore the allies' HP and increase the summoned creatures' ATK. Additionally, Cotton Cookie summons sheep that will charge at the enemies, dealing area damage and stunning them. The summoned sheep will fight alongside the Cookies for a certain time. While Cotton Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Healing: 9.9% (ATK) every 1.0 sec for 9.0 sec",
          "ATK Increase: 75.0% while the lantern is lit",
          "Sheep Herd: 124.5% of the Cookie's ATK, 157.8% of DEF, 111.4% of HP",
          "Sheep Stampede: stun for 1.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 17
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Cotton_Cookie",
      "magic-skill": null,
      "bio": "The soft and warm cotton fluff in Cotton Cookie's dough granted her a heart so warm not even a raging blizzard could scare her off. The way she handles her flock of cute wooly sheep ever so gently with her tiny lantern in hand can make anyone feel at peace! Having a lantern in Cotton Cookie's land of constant snowfall is very important: not only stray sheep but also Cookies lost among the dreary white hills depend on it. Cotton Cookie can often be seen restlessly looking at the sky on snowy days—as though expecting to find something amidst the drifting snowflakes. Sometimes, she mentions a Cookie dear to her: her serene, calm face lightens up, making the listener wonder... what happened? Will we ever learn that someone out there is keeping a piece of these snowy plains in their heart? And that a warm yellow light of the tiny lantern will always shine for that special someone. Always."
    },
    {
      "name": "Cherry Blossom Cookie",
      "rarity": "Epic",
      "class": "Ambush",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Cherry Blossom Rain",
        "description": "Get ready for a storm of cherry blossoms! Cherry Blossom Cookie flies up to shower her enemies with a rain of cherry blossoms, dealing area damage. She will deal additional damage to non-Cookie opponents and increase the ATK of all allies: the bonus value will depend on the number of enemies hit with the skill.",
        "effect": [
          "DMG: 48.3%",
          "Additional DMG to non-Cookie targets: 10.0%",
          "With each 3 hits, the DMG decreases by 20.0% (cannot get decreased by more than 80.0%"
        ],
        "cd-start": 0,
        "cd-base": 17
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Cherry_Blossom_Cookie",
      "magic-skill": null,
      "bio": "On a warm spring day, the first pink cherry blossoms were collected, then infused for a generous amount of time. Then this essence was used to create Cherry Blossom Cookie. Just by looking at her, you will feel splendid and warm inside, with a tingle on both your cheeks. On a perfect day, you can see her humming, trying to fly into the air with her umbrella open. She is most adorable when she offers you delicious sandwiches and tea. But watch out, once she starts to chat, you will lose track of time!"
    },
    {
      "name": "Oyster Cookie",
      "rarity": "Super Epic",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Might of Oyster House",
        "description": "The first Cooldown of Oyster Cookie's skill will be shortened, allowing for faster skill use. Summons soldiers of House Oyster and increases the CRIT% and CRIT DMG for herself and nearby allies for a certain amount of time. The summoned soldiers will immediately charge at the enemies, dealing damage. The soldiers will have extra DEF until the HP of their shields hits zero. Their shields will also resist Knockbacks and Flying. When Oyster Cookie receives a cooldown reduction buff, instead of cooldown reduction, the number of Oyster Soldiers and their ATK will increase. While Oyster Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Soldiers' Charge DMG: 94.0%",
          "Oyster Soldiers: caster's 42.9% ATK, 179.0% DEF, 118.0% HP",
          "CRIT% Boost: 16.5% for 17.0 sec",
          "CRIT DMG Boost: 13.0% for 17.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 17
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Oyster_Cookie",
      "magic-skill": null,
      "bio": "Massive merchant vessels with mermaid statues adorning the stemhead fill the docks of the Creme Republic, all waiting for Oyster Cookie's command. All it takes is one single wave to signal the giant ships to cross the ocean and create new tides. With her noble allure and eloquent words that can steer the conversation the way she wishes, one can't help but be in awe of Oyster Cookie's presence. Some Cookies wonder how a Cookie of the Sea could achieve such fame and prestige among the Republic's crème de la crème. One theory is that House Oyster is somehow connected to the underwater mermaids from the old legends, but no one knows the truth. Oyster Cookie is known to exert her power and influence to create a favorable tide whenever precious goods and valuable information are involved. Perhaps that's why the ambitious come knocking at Manor Oyster's doors. Because some offers are worth risking it all!"
    },
    {
      "name": "Cream Unicorn Cookie",
      "rarity": "Epic",
      "class": "Healing",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Midsummer Night's Dream",
        "description": "The music starts, and Cream Unicorn Cookie transforms into the Dreamy Unicorn. The Dreamy Unicorn reduces Crit DMG received by the team and charges towards the enemies, silencing them. While silenced, the enemies skill Cooldown will be paused. The Dreamy Unicorn will leave Dancing Butterflies behind itself. These butterflies will fly towards the allies and heal them. The amount of Healing received depends on the amount of HP lost. Regular Healing targets will receive a DMG-reducing buff.",
        "effect": [
          "Silence: 1.0 sec",
          "Healing: 1.6% of DMG per each 1% of HP lost",
          "Healing: 39.6% of DMG",
          "Crit DMG Reduction: -17.5% for 10.0 sec",
          "DMG Reduction: -5.0% for 12.0 sec, stacks up to 3 times"
        ],
        "cd-start": 0,
        "cd-base": 17
      },
      "magic-candy": "Dreamy Pastel Meringue",
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Cream_Unicorn_Cookie",
      "magic-skill": {
        "name": "",
        "description": "",
        "effect": [],
        "10": [],
        "20": [],
        "30": [],
        "cd": 0
      },
      "bio": "A desolate amusement park lies in darkness. Lights flicker on one by one. A merry-go-round begins to rotate slow and steady to a bygone song of the past. The park magically returns to life as a lone pony, embraced by the purest of rainbows, opens their eyes. The silky mane and creamy tail turn into elegant locks of hair. Decorations spring to life as fluttering sugar butterflies. Cream Unicorn Cookie flies around the park with the sugar butterflies in tow. After floating among the attractions, a graceful landing on top of the Ferris wheel concludes the course. A whisper escapes while gazing upon the entirety of the park. \"In the end, all that shines are memories and stars.\" A flashback of the glee and joy of young Cookies running towards the merry-go-round plays before wistful eyes. If only it could turn for eternity... A dream to be a part of the happiness and laughter of children has manifested as a unicorn. The dream never stops, regardless of night or day."
    },
    {
      "name": "Hollyberry Cookie",
      "rarity": "Ancient",
      "class": "Defense",
      "location": "Front",
      "type": "Normal",
      "skill": {
        "name": "Oath on the Shield",
        "description": "Let out a war cry of fury! Hollyberry Cookie charges forward and becomes a shield to her Cookie allies, absorbing a portion of the damage they take, excluding periodic and indirect damage. While her DMG Focus is active, she will reduce CRIT received by her allies and herself, and gain a stack of Seed of Life for every CRIT hit she receives. Once she gains enough Seed of Life stacks, the Seed of Life will bloom into Berry of Life, enhancing the succeeding skill. The cooldown for Hollyberry Cookie's first skill is reduced, allowing her to use it faster. While Hollyberry Cookie is using her skill, she will briefly become resistant to interrupting effects.",
        "effect": [
          "Single hit DMG: 185.5%",
          "DMG Focus: 20.0% of DMG of allies for 9.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 18
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Hollyberry_Cookie",
      "magic-skill": null,
      "bio": "What else could result in such an overwhelming passion if not the reddest hollyberries, ripened under the hottest summer sunlight? Hollyberry Cookie believes that every friendship, like victory, should be triumphant. After all, there's nothing in the word as hard as trust! Not even the all-enduring Hollyberry Shield with which she swore to protect her beloved ones. It is said that Hollyberry Cookie leading a charge onto the battlefield is the most inspiring view. A view that inspires to repay with trust to those who put trust in you."
    },
    {
      "name": "Peppermint Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Rear",
      "type": "Water",
      "skill": {
        "name": "Freshness of the Sea",
        "description": "Peppermint Cookie blows the conch shell to summon the Peppermint Whale. The refreshing sound of the conch shell heals the team, increasing their DMG Resist and Debuff Resist. The Peppermint Whale creates a wave, dealing Water-type damage to enemies in front of it, and also Heals the allies for an amount equal to a portion of the damage dealt. Fresh water brought by the whale covers the team with an HP Shield. Peppermint Cookie will briefly become resistant to interrupting effects while using the skill.",
        "effect": [
          "Healing: 90.3% of ATK",
          "DMG Resist: 14.5% for 15.0 sec",
          "HP Shield: blocks DMG equal to 15.0% of Max",
          "HP for 5.0 sec",
          "Peppermint Wave DMG: 607.4%"
        ],
        "cd-start": 0,
        "cd-base": 17
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Peppermint_Cookie",
      "magic-skill": null,
      "bio": "Mint leaves for Peppermint Cookie were gathered from a town near the clear sea. This Cookie likes to spend time at the shore, staring dreamily at the horizon, or playing the shell ocarina. An old friend, the Peppermint Whale, often appears to the sound for company. Peppermint Cookie treasures the simple but unchanging things, just like the waves that come and go. May the Cookie's smile remain unchanging as well!"
    },
    {
      "name": "Devil Cookie",
      "rarity": "Rare",
      "class": "Magic",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Devilish Rune",
        "description": "Summons the Devilish Rune dealing damage over time to enemies standing on it and reducing their ATK SPD and MOV SPD.",
        "effect": [
          "DMG every 0.5 sec for 7.0 sec",
          "Total Periodic DMG: 115.0%",
          "-15.0% ATK SPD above the Rune",
          "-15.0% MOV SPD above the Rune"
        ],
        "cd-start": 0,
        "cd-base": 18
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Devil_Cookie",
      "magic-skill": null,
      "bio": "Devil Cookie is mysterious in many ways. This Cookie might look hot and spicy but tastes like fizzy cola. According to a trustworthy source, they are made of bat extract and a few drops of carbonated beverage. Little trickster's ultrasonic powers allow them to see Cookie souls invisible to the others. Devil Cookie is also capable of summoning the horribly powerful and tremendously sugary Devilish Rune straight from the fiery lower trays of existence."
    },
    {
      "name": "Pumpkin Pie Cookie",
      "rarity": "Epic",
      "class": "Magic",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Pompon, help!",
        "description": "Pumpkin Pie Cookie's Pompon grows to a giant size, causing area damage. For a given period of time, Giant Pompon inflicts melee area damage up to 3 enemies and applies a non-stackable debuff, decreasing the amount of healing the enemies receive. While on the battlefield, Giant Pompon increases ATK SPD for all allied summoned creatures. Giant Pompon will be more resistant to interrupting effects while performing the first special attack. Also, Pumpkin Pie Cookie can use her decreased first cooldown to use the skill sooner. Pompon is resistant to certain interruption effects.",
        "effect": [
          "Summon Pompon with 44.4% ATK, 188.0% DEF, and 382.3% HP",
          "Healing received: -70.0% for 3.0 sec",
          "Pompon's Strike Attack DMG: 170.0%"
        ],
        "cd-start": 0,
        "cd-base": 18
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Pumpkin_Pie_Cookie",
      "magic-skill": null,
      "bio": "It's Halloween, a time of spooky fun for all ghosts and Cookies. And amidst the Jack-o'-lanterns adorning the streets, stands Pumpkin Pie Cookie watching others dressed up in their costumes. Perhaps it's because she was made of a pumpkin that grew in the shade of an abandoned house, untouched by the sun, but she seems... distant, even though she has a smile on her face. One might try to escape this Cookie's uncanny presence, but there is something eerily captivating in the way she slowly bats her eyelashes... Pumpkin Pie Cookie's favorite things on Earthbread are her fluffy and poofy dress that resembles a pumpkin and the old, tattered doll she always carries around. This Cookie will hold your hand and drag you to play with her whenever there's an exciting festival. Surprisingly, no one has ever said no. You can only wonder if it's because of Pumpkin Pie Cookie's doll that looks almost alive or the giant wavering shadow behind her..."
    },
    {
      "name": "Carrot Cookie",
      "rarity": "Rare",
      "class": "Support",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Carrot Harvest",
        "description": "Pulls the hardest carrots from the ground and shoots them at the enemy, causing area damage and increasing the party's Defense. Carrots collected after an attack restore some HP.",
        "effect": [
          "Single hit DMG: 138.0%",
          "Each carrot restores HP equal to 20.1% of ATK"
        ],
        "cd-start": 0,
        "cd-base": 19
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Carrot_Cookie",
      "magic-skill": null,
      "bio": "The sun is burning! Lumps of rich black soil are being tossed right and left! Sweat is flowing! Carrot Cookie is having yet another pleasant day of working in the fields! This genius farmer knows the secret of growing delicious giant vegetables out of the smallest seeds. She even had to fix the roof of her house after one of her green giants had grown a bit too big. But for Carrot Cookie there's no such thing as \"too big!\" And when it's harvest season, the Cookie forgets about everything but her farm! Come rain or shine, her crops always flourish!"
    },
    {
      "name": "Onion Cookie",
      "rarity": "Rare",
      "class": "Support",
      "location": "Middle",
      "type": "Normal",
      "skill": {
        "name": "Unstoppable Tears",
        "description": "Doesn't perform Regular Attacks frozen in fear. Use this skill to let out a deafening cry, causing wide area damage and lowering the enemy's Attack Power. The higher the fear level, the more powerful the skill.",
        "effect": [
          "67.0% DMG (1 stack)",
          "up to 670.0% (10 stacks)",
          "-10.0% ATK for 6.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 19
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Onion_Cookie",
      "magic-skill": null,
      "bio": "Your eyes will start to water if you get too close to this onion-based Cookie! And once she starts crying, she cannot stop. Mainly because her tears consist of onion juice that makes her cry even more. Poor thing, she is terrified of ghosts and weeps when scared. Perhaps one day, she'll realize why her surroundings sometimes become ghostly, and clocks suddenly start ticking backwards."
    },
    {
      "name": "Prophet Cookie",
      "rarity": "Epic",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Seven Prophecies",
        "description": "Prophet Cookie delivers one out of seven prophecies. Upon invoking a prophecy, Prophet Cookie will heal an ally and amplify buffs they receive. Additionally, an extra skill effect will be activated depending on the symbol of the prophecy, dealing damage to the enemies and amplifying debuffs they receive. The debuffs applied by the prophecies are weaker than those of the original skills and does not inflict elemental type DMG. Some prophecies do not have any additional effects. You can lock the effect of the prophecy, guaranteeing a specific effect, by equipping Toppings. While Prophet Cookie is using his skill, he will briefly become resistant to interrupting effects. Wandering around the Kingdom, Prophet Cookie will come up with Fortune Cookies every three days. Tap the Fortune Cookie to obtain a gift. The higher Prophet Cookie’s rank, the better gift!",
        "effect": [
          "DMG of Seven Prophecies: total DMG will range from 103.6% to 360.5%",
          "Healing: heals 10.0% of ATK every 1 sec for 5 sec",
          "Locked Prophecy: activated upon exceeding 10.0% in CRIT% with Toppings"
        ],
        "cd-start": 0,
        "cd-base": 19
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Prophet_Cookie",
      "magic-skill": null,
      "bio": "This wizened Cookie is often called \"Fortune Cookie\" for his ability to know what's coming before it happens. His Scroll of Prophecy guides his path, even if it isn't always right. Some say the source of his foresight is his mysterious purple Crystal Ball, but in reality, it is his majestic beard!"
    },
    {
      "name": "Icicle Yeti Cookie",
      "rarity": "Special",
      "class": "Healing",
      "location": "Front",
      "type": "Ice",
      "skill": {
        "name": "Let's Be Friends!",
        "description": "Icicle Yeti Cookie buffs the allies and periodically restores their HP. They will assume the yeti form, jump towards the nearest enemy, and create a Shield of Ice to protect them. The Shield of Ice will absorb a portion of all incoming direct non-periodic damage and make the team resistant to Freezing. Then, Icicle Yeti Cookie will return to their position and deal a portion of the damage received in the yeti form with an icicle attack.",
        "effect": [
          "Healing: 6.7% of ATK every 1.0 sec for 10 sec",
          "Additional Healing for Ice-type Skill Cookies: 16.9% of ATK",
          "DMG Resist: 15.5% for 10 sec",
          "Freeze Resistance: Freeze Duration 8 DMG -70.0% for 10 sec",
          "Yeti Transformation",
          "Shield of Ice: absorbs 30.0% of DMG received by allies during Yeti Transformation",
          "Icicle DMG: deals 5.0% of all DMG received by themselves during Yeti Transformation"
        ],
        "cd-start": 0,
        "cd-base": 12
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Icicle_Yeti_Cookie",
      "magic-skill": null,
      "bio": "Is there a friend this Yeti can share this perfect morning with? Icicle Yeti's song echoes and breaks the chilly dawn, signaling the start of another day. This adorable Yeti used to be an icicle in a cave, but one day, a powerful being of frost was born... And along with them, this creature too was imbued with life! In legends, Yetis are depicted as ferocious and dangerous, but this particular one only wanted a friend to call their own. Melting and softening their spikes here and there turned them into an adorable Cookie! Small yet mighty—Icicle Yeti Cookie can pick up a Cookie like they weigh nothing, and fight off enemies with one hand! What excites this Cookie the most is making snowmen and having snowball fights with their new buddy! Cold to the touch, but warm at heart—this friendly Cookie is always ready to make new friends!"
    },
    {
      "name": "Snapdragon Cookie",
      "rarity": "Special",
      "class": "Support",
      "location": "Rear",
      "type": "Normal",
      "skill": {
        "name": "Arcane Blossom",
        "description": "As an ancient entity, Snapdragon Cookie is safeguarded and invulnerable to enemy attacks. The elder magic of their skill will bloom snapdragons, periodically healing the team's HP and granting a buff providing Stun resist, increased Debuff Resist, increased ATK, increased DMG Resist, and an HP Shield. Elder magic grants Dragon Cookies Draconic Lifeforce, increasing the Max HP of Dragon Cookies.",
        "effect": [
          "Healing: 12.3% every 1.0 sec for 7.0 sec",
          "Stun Resistance: Stun duration -65.0% for 10.0 sec",
          "HP Shield equal to 13.5% of Max HP for 5.0 sec"
        ],
        "cd-start": 0,
        "cd-base": 17
      },
      "magic-candy": null,
      "topping": [],
      "sub-stats": [],
      "pve": "",
      "pvp": "",
      "guide-link": "",
      "wiki-link": "https://cookierunkingdom.fandom.com/wiki/Snapdragon_Cookie",
      "magic-skill": null,
      "bio": "Dragon City, once a dwelling place for ancient draconic power, has a particular legend passed down from generation to generation. \"On the day the world is engulfed in a sea of fire, a dragon that will plunge the world into chaos shall awaken.\" After a horrendous night when the Red Dragon from the Dragon's Valley burned the city to a crisp, a creature opened its eyes for the first time in the Dragon City Square... A baby with flowers for a tail, Snapdragon! Could this playful hatchling with eyes full of curiosity be the dragon from the legend? No one can be sure just yet, but the way the little creature imitates Pitaya Dragon Cookie speaking Dragontongue or transforms into their Cookie form at will show that they're no regular dragon. Abwubu! Abwaba! The small and cute baby dragon babbles on endlessly, excited to explore its new surroundings. But... who knows what kind of creature Snapdragon Cookie will grow to be?!"
    }
  ]
}
